{"id":"HsxT2cpPWYzTg9tpY","title":"D&D.Sci","link":"https://www.lesswrong.com/posts/HsxT2cpPWYzTg9tpY/d-and-d-sci","published":1714239264000,"description":"Published on December 5, 2020 11:26 PM GMTYou are studying to become an Adventurer. You’re excited to begin your Great Quest, but also anxious: over a third of the graduates from your program fail to accomplish their Great Quests. And if you’re being brutally honest with yourself, your odds are probably worse than that, since your stats – while about average for the general population – are pretty lousy by the standards of Adventurer College.STR: 6/20CON: 14/20DEX: 13/20INT: 13/20WIS: 12/20CHA: 4/20On the eve of your graduation, you’re visited by a mysterious fairy offering to add a total of ten extra points to whichever attributes you most want to improve. Following the college’s standard mysterious fairy protocol, you humbly request a week for research and contemplation before deciding how best to use this one-in-a-lifetime opportunity. (Your low Charisma ensures you come off as simultaneously entitled and disinterested when saying this, but she agrees regardless.)The college Archivist provides you a complete but anonymised record of the stats of everyone who graduated last year, and whether they succeeded at their Great Quests. (The record-keeping is magically perfect, and as Great Quests never take more than a year there are no incomplete Great Quests to account for.) The rest is up to you. Where will you allocate those ten points?I’ll be posting an interactive letting you test your decision, along with a complete explanation of the dataset, sometime next Saturday. I’m giving you a week, but the task shouldn’t take more than a few hours; use Excel, R, Python, random guessing, or whatever other tools you think are appropriate. Let me know in the comments if you have any questions about the scenario.ETA: If you want to investigate this collaboratively with other lesswrongers (or just share your conclusions without waiting a week), feel free to do so in the comments; however, please use spoiler tags when sharing inferences, so people intending to fly solo can look for clarifications without being spoiled.Discuss","pubDate":"Sat, 27 Apr 2024 17:34:24 GMT"}