{"id":"Mi5kSs2Fyx7KPdqw8","title":"Don’t ignore bad vibes you get from people","link":"https://www.lesswrong.com/posts/Mi5kSs2Fyx7KPdqw8/don-t-ignore-bad-vibes-you-get-from-people","published":1737332368000,"description":"Published on January 18, 2025 9:20 AM GMTI think a lot of people have heard so much about internalized prejudice and bias that they think they should ignore any bad vibes they get about a person that they can’t rationally explain. But if a person gives you a bad feeling, don’t ignore that. Both I and several others who I know have generally come to regret it if they’ve gotten a bad feeling about somebody and ignored it or rationalized it away. I’m not saying to endorse prejudice. But my experience is that many types of prejudice feel more obvious. If someone has an accent that I associate with something negative, it’s usually pretty obvious to me that it’s their accent that I’m reacting to. Of course, not everyone has the level of reflectivity to make that distinction. But if you have thoughts like “this person gives me a bad vibe but maybe that’s just my internalized prejudice and I should ignore it”, then you probably have enough metacognition to also notice if there’s any clear trait you’re prejudiced about, and whether you would feel the same way about other people with that trait. Naturally, “don’t ignore the bad feeling” also doesn’t mean “actively shun and be a jerk toward them”. If they’re a coworker and you need to collaborate with them, then sure, do what’s expected of you. And sometimes people do get a bad first impression of someone that then gets better – if the bad feeling naturally melts away on its own, that’s fine. But if you’re currently getting a bad feeling about someone and they make a bid for something on top of normal interaction… like if they ask you out or to join a new business venture or if you’re just considering sharing something private with them… you might want to avoid that. I don’t have any rigorous principled argument for this, other than just the empirical personal observation that ignoring the feeling usually seems to be a mistake. Consider reversing this advice in the case where you tend to easily get a bad vibe from everyone. Anni Kanniainen comments: I struggle with trauma-related trust issues, so sometimes I might get bad vibes merely due to my own withdrawn nature in the situation or the fact that I expect the worst from a situation — i.e. meeting with a lady during a weekend out and finding later that she’s approached me with a voice message, so I assume she’s yelling at me about something I had done wrong. That being said, I think there is a genuine bad vibe you may sometimes get — and often it’s a calmer and more rational one that you would get with a gut-punch of anxiety. You notice it best by observing how an individual talks or behaves in a social context or by interpreting their current actions through the information you’ve already acquired. This approach tends to work, but sometimes entertaining your intuitions only make the anxiety bigger. As an another point in the opposite direction, I do also endorse the adage of trust beyond reason, as defined in that link – as long as you don’t get a bad vibe.Discuss","pubDate":"Mon, 20 Jan 2025 00:19:28 GMT"}