{"id":"X2og6RReKD47vseK8","title":"How I started believing religion might actually matter for rationality and moral philosophy","link":"https://www.lesswrong.com/posts/X2og6RReKD47vseK8/how-i-started-believing-religion-might-actually-matter-for","published":1726770365000,"description":"Published on August 23, 2024 5:40 PM GMTAfter the release of Ben Pace's extended interview with me about my views on religion, I felt inspired to publish more of my thinking about religion in a format that's more detailed, compact, and organized. This post is the first publication in my series of intended posts about religion.Thanks to Ben Pace, Chris Lakin, Richard Ngo, Damon Pourtahmaseb-Sasi, Marcello Herreshoff, Renshin Lauren Lee, Mark Miller, and Imam Ammar Amonette for their feedback on this post, and thanks to Kaj Sotala, Tomáš Gavenčiak, Paul Colognese, and David Spivak for reviewing earlier versions of this post. Thanks especially to Renshin Lauren Lee and Imam Ammar Amonette for their input on my claims about religion and inner work, and Mark Miller&nbsp;for vetting my claims about predictive processing.In&nbsp;Waking Up, Sam Harris wrote:[1]&nbsp;But I now knew&nbsp;that Jesus, the Buddha, Lao Tzu, and the other saints and sages of history had not all been epileptics, schizophrenics, or frauds. I still considered the world’s religions to be mere intellectual ruins, maintained at enormous economic and social cost, but I now understood that important psychological truths could be found in the rubble.Like Sam, I’ve also come to believe that there are psychological truths that show up across religious traditions. I furthermore think these psychological truths are actually very related to both rationality and moral philosophy. This post will describe how I personally came to start entertaining this belief seriously.“Trapped Priors As A Basic Problem Of Rationality”“Trapped Priors As A Basic Problem of Rationality” was the title of an AstralCodexTen blog post. Scott opens the post with the following:Last month I talked about van der Bergh et al’s work on the precision of sensory evidence, which introduced the idea of a trapped prior. I think this concept has far-reaching implications for the rationalist project as a whole. I want to re-derive it, explain it more intuitively, then talk about why it might be relevant for things like intellectual, political and religious biases.The post describes Scott's take on a predictive processing account of a certain kind of cognitive flinch&nbsp;that prevents certain types of sensory input from being perceived accurately, leading to beliefs that are resistant to updating.[2]&nbsp;Some illustrative central examples of trapped priors:Karl Friston has written about&nbsp;how a traumatized veteran might not hear a loud car as a car, but as a gunshot instead.Scott mentions phobias and sticky political beliefs as central examples of trapped priors.I think trapped priors are very related to the concept that “trauma” tries to point at, but I think “trauma” tends to connote a subset of trapped priors that are the result of some much more intense kind of injury.&nbsp;“Wounding” is a more inclusive term than trauma, but tends to refer to trapped priors learned within an organism’s lifetime, whereas trapped priors in general also include genetically pre-specified priors, like a fear of snakes.&nbsp;My forays into religion and spirituality actually began via the investigation of my own trapped priors, which I had previously articulated to myself as “psychological blocks”, and explored in contexts that were adjacent to therapy (for example, getting my psychology dissected at&nbsp;Leverage Research, and experimenting with Circling). It was only after I went deep in my investigation of my trapped priors that I learned of the existence of traditions emphasizing the systematic and thorough exploration of trapped priors. These tended to be spiritual traditions, which is where my interest in spirituality actually began.[3]&nbsp;I will elaborate more on this later.&nbsp;Active blind spots&nbsp;as second-order trapped priorsOne of the hardest things about working with trapped priors is recognizing when we’ve got them in the first place. When we have trapped priors, we’re either consciously aware we’ve got a trapped prior (for example, in the case of a patient seeking treatment for a phobia of dogs), or we can have a second-order (meta-level) trapped prior that keeps us attached to the idea that the problem is entirely external.&nbsp;Consider the difference between “I feel bad around dogs, but that’s because I have a phobia of dogs” and&nbsp;“I feel bad around [people of X political party], and that’s because [people of X political party] are BAD“. &nbsp;I think second-order trapped priors are related to the phenomenon where people sometimes seem to actively resist getting something that you try to point out to them. Think of a religious fundamentalist, or a family member who resists acknowledging their contributions to relational conflicts.&nbsp;I call this an active blind spot.&nbsp;One thing that distinguishes active blind spots from blind spots in general is that there’s an element of fear and active resistance around “getting it”. In contrast, someone could have a “passive blind spot”&nbsp;in which they’re totally open to “getting it”, but simply haven’t yet been informed about what they’ve been missing.[4]&nbsp;I think active blind spots and second-order trapped priors actually correspond pretty directly. This element of fear around “getting it” is captured in the first-order trapped prior, and the second-order trapped prior functions as a mechanism to obfuscate that you’re trying&nbsp;to&nbsp;\"not get it”.There are many parallels between active blind spots and lies – they both spread and grow; their spreading and growing can both lead to outgrowths that have “lives of their own”&nbsp;disconnected from the larger whole from which they originated; and they’re both predicated on second-order falsehoods that “double down” on first-order falsehoods (a lie involves both a false assertion X and the second-order false assertion “the assertion X is true”, the latter of which distinguishes a lie from something false said by mistake). In some sense, an active blind spot is&nbsp;a lie, with the first-order falsehood being a perceptual misrepresentation (like the veteran “mishearing” the loud car as a gunshot) rather than a verbal misrepresentation.I think it can get arbitrarily difficult to recognize when you’ve got active blind spots, especially when your meta-epistemology (i.e., how you discern where your epistemology is limited) might have active blind spots baked into them since before you've developed episodic memory, which I’ll describe later in this post.&nbsp;Inner work ≈ the systematic addressing of trapped priorsFor me, the concept of “inner work” largely refers to the systematic addressing of trapped priors, with the help of tools like therapy, psychedelics, and meditation – all of which&nbsp;Scott Alexander explicitly mentioned as potential tools for addressing trapped priors&nbsp;(see the highlighted section here). I’ve found inner work particularly valuable for noticing and addressing my own active blind spots, which has led to vastly improved relationships with family, romantic partners, colleagues, and friends, by virtue of me drastically improving at taking&nbsp;responsibility for my contributions to relational conflicts.&nbsp;I think a lot of modern-day cults (e.g. Scientology, NXIVM) were so persuasive because their leaders were able to guide people through certain forms of inner work, leading to large positive effects&nbsp;in their psychology that they hadn’t previously conceived of as even being possible.There are major risks involved in going deep into inner work.&nbsp;If one goes deep enough, it can amount to a massive refactor of “the codebase of one’s mind”, all the while one tries to continue living their life. Just as massively refactoring a product’s codebase risks breaking the product (e.g. because spaghetti code that was previously sufficient to get you by can no longer function without getting totally rewritten), refactoring the codebase of your mind can “break” your ability to perform a bunch of functions that had previously come easily.A commonly reported example is people switching away from coercion as a source of motivation, and then&nbsp;being less capable of producing output, at least for a while (like publishing on the internet, in my case 😅).&nbsp;In more extreme cases, people may lose the ability to hold down jobs, or may get stuck in depressive episodes.Because of the risks involved, I think going deep into inner work is best done with the support of trustworthy peers&nbsp;and mentors. Cults&nbsp;often purport to offer these, but often end up guiding people’s inner work in ways that end up exploiting and abusing them.This naturally invites the question of how to find ethical and trustworthy traditions of inner work. I will now describe a formative experience I had that led me to seriously entertain the hypothesis that religious mystical traditions fit the bill.Religious mystical traditions as time-tested&nbsp;traditions of inner work?My entire worldview got turned upside-down the first time I experienced the healing of a trauma from infancy. It was late 2018, and I was in San Francisco, having my third or fourth session with a sexological bodyworker[5]&nbsp;recommended to me by someone in the rationalist community.[6]&nbsp;The experience started with me saying that I’d felt very small and lonely and that I’d wanted to curl up into a little ball. To my shock, my bodyworker&nbsp;suggested that I do exactly that. She proceeded to sit next to me, envelop her arms around me like I was a baby, rocking me, and telling me that everything would be okay. I suddenly had a distinct somatic memory of being a baby (when I recall memories of kindergarten, there’s a corresponding somatic sense of being short and having tiny limbs; with the activation of this memory, I had a body-sense of being extremely tiny and having very&nbsp;tiny limbs).[7]&nbsp;I found myself wailing into her arms as she rocked me back and forth, and feeling the release of a weight I’d been carrying on my shoulders my whole life, that I’d never had any conscious awareness or recollection of having carried.When I sat up, my moment-to-moment experience of reality was radically different. I could suddenly feel my body more fully, and immediately thereafter understood what people meant when they told me that I was constantly “up in my head”. My very conception of what conscious experience could be expanded, since all my prior conceptions of conscious experience had involved this weight on my shoulder, for as long as I’d had episodic memory.&nbsp;I was hungry for ways to account for this experience. I felt like I had just been graced with a profound and bizarre experience, with enormous philosophical implications, that very few people even recognize exist. It seemed obviously relevant for our attempts to understand personal identity and human values that our senses of who we are and what we value might be distorted by active blind spots rooted in experiences from before we’d developed episodic memory.&nbsp;I had also been pondering the difficulty of metaphilosophy in the context of AI alignment, and it seemed obviously relevant for metaphilosophy that people’s philosophical intuitions could get distorted by preverbal trapped priors, and therefore that humanity’s understanding of metaphilosophy might be bottlenecked by an awareness of preverbal trapped priors.For the first time, it seemed plausible to me that the millennia-old questions about moral philosophy[8]&nbsp;might only have seemed intractable because most of the people thinking about them didn’t know about the existence of preverbal trapped priors. This led me to become very curious about the worldviews held by people who were familiar with preverbal trapped priors. Every person I’d trusted who’d recognized this experience when I described it to them (including the bodyworker who facilitated this experience, some Circling facilitators, and a Buddhist meditation coach[9]) had done lots of inner work themselves, had received significant guidance from religious and spiritual traditions, and had broad convergences among their worldviews that also seemed consistent with the commonalities between the major world religions.I was pretty sure all these people I'd trusted were on to something, which was what led me to start seriously considering the hypothesis that the major world religions implicitly claim to have solutions to the big problems of moral philosophy because they actually once did.[10]&nbsp;(WTF, RIGHT???) To be more precise, I’d started to seriously consider the hypothesis that:people who go deep enough exploring inner work “without going off the rails” tend to notice subtle psychological truths that hold the keys to solving the big problems of moral philosophyhumanity has implicitly stumbled upon the solutions to the big problems of moral philosophy many times over, and whenever this happens, the solutions typically get packaged in some sort of religious traditionthe reason this is not obvious is because religious memes tend to mutate in ways that select for persuasiveness to the masses, rather than faithfulness to the original psychological truths, which is why they suck so much in all the ways LessWrongers know they suckThe more deeply I explored religions, and the deeper I went down my inner work journey, the more probable my hypothesis came to seem. I’ve come to believe that the mystical traditions of the major world religions are still relatively faithful to these core psychological truths, and that this is why there are&nbsp;broad convergences in their understandings of the human psyche, the nature of reality,[11]&nbsp;their prescriptions for living life well, and their approaches toward inner work.[12]&nbsp;I think these traditions, whose areas of convergence could together be referred to as the perennial philosophy, are trustworthy insofar as they constitute humanity’s most time-tested&nbsp;traditions of inner work.The next post will go into further detail about my interpretations of some central claims of the perennial philosophy.&nbsp;^I have a number of substantial disagreements with Sam Harris about how to think about religion, and in general think he interprets religious claims in overly uncharitable ways (that nevertheless seem understandable and defensible to me). I do appreciate the clarity and no-bullshit attitude he brings toward his interpretations of spirituality, though, and wish more people adopted an analogous stance when sifting through spiritual claims.^Scott says the more official predictive processing term for this is “canalization”. I think this is mostly correct, with one caveat – canalization doesn’t necessarily imply maladaptiveness, whereas I think “trapped priors” imply a form of canalization that prevents the consideration of more appropriate alternative beliefs. In other words, I think someone’s belief can only be judged as trapped relative&nbsp;to an alternative belief&nbsp;that’s more truthful and more adaptive.By analogy, there’s a trope that trauma healing is a first-world concern, because “trauma responses” for those in the first-world may just be effective adaptations for those in the third-world. It might make perfect sense for someone growing up hungry in the third-world to hoard food and money, because starvation is always a real risk. It’s only if they move to a first-world country where they will clearly never again be at risk of starvation, yet continue to hoard food and money as though starvation remains a constant risk, that it would make sense to consider this implicit anticipation of starvation a trapped prior.Often, it’s clear from the context what the superior alternative belief is – for example, a veteran hearing the sound of a loud car as a gunshot would obviously do better hearing it as a car than as a gunshot. But I think the concept of “trapped prior” can get slippery or confusing sometimes if this contextuality isn’t made explicit, so I’m making an explicit note of it here.^Renshin Lauren Lee notes that Buddhism could be thought of as a religion based in letting go of all trapped priors, and actually, to let go of all priors, period. Renshin also notes that this doesn't capture all of Buddhism, since it's also about compassion and ethics, but that Buddhism does make the radical claim that relieving all priors is critical for ethics / compassion / happiness / living a good life.^I will mention that it’s not obvious to me that the distinction between active and passive blind spots is always as clear and clean-cut as I’m presenting it to be, and that I might be oversimplifying things a bit.^Her name is Kai Wu.&nbsp;^Thanks for changing my life, Tilia!^People often express skepticism that I can actually access such a memory, and I think this is partly because the thing I mean by “memory” here is different from what most people imagine by “memory”. In particular, it’s more like an emotional memory&nbsp;than it is an episodic memory, and the experience is more somatic and phenomenological than it is visual or verbal. To further illustrate – if a dog bit me when I was a toddler, I might have no explicit recollection of the event, but my fight-or-flight response might still activate in the presence of dogs. If I were to do exposure therapy with dogs, I would consider the somatic experiences of fear I feel in the presence of these dogs to be a form of \"memory access\". As I continue titrating into this fear, I might even feel activation around the flesh where I’d gotten bitten, without necessarily any episodic recollection of the event. These are the kinds of “memory access” that I’d experienced in the bodywork session.^The linked excerpt does not explicitly mention moral philosophy per se, but I consider the subjects of the excerpt to be substantially about moral philosophy.^When I described my experience to Michael Taft, he said something like “Infant traumas? That’s old news, Alex. Buddhists have known about this for thousands of years. They didn’t have a concept of trauma, so they called it ‘evil spirits leaving the body’, but this is really what they were referring to.”^As a concrete illustration for how this might not be totally crazy, I think metaethics is largely bottlenecked on the question “where do we draw the boundaries around the selves that are alleged to be moral patients?” and Buddhism has a lot of insight into personal identity and the nature of self – including that our conceptions of ourselves are distorted by preverbal trapped priors.^Truths about psychology can bleed into truths about the nature of reality. This might be counterintuitive, because truths about psychology ostensibly concern our maps of reality, whereas truths about reality concern reality itself. But some of these psychological truths take the form “most of our maps of reality are biased in some particular way, leading our conceptions of reality to also be biased in that particular way; if we correct these biases in our best guesses of what reality is actually like, we find that reality might actually be very different from what we’d initially thought”.^I often employ an analogy with geometry, which a bunch of civilizations figured out (semi-)independently. The civilizations didn’t prove the exact same theorems, some civilizations figured out way more than others, and some civilizations got some important details wrong (e.g. the Babylonians thought π = 3.125), but there was nevertheless still a shared thing they were all trying to get at.Discuss","pubDate":"Thu, 19 Sep 2024 18:26:05 GMT"}