{"id":"y8ysGMphfoFTXZcYp","title":"Biological risk from the mirror world","link":"https://www.lesswrong.com/posts/y8ysGMphfoFTXZcYp/biological-risk-from-the-mirror-world","published":1734206229000,"description":"Published on December 12, 2024 7:07 PM GMTA new article in Science Policy Forum voices concern about a particular line of biological research which, if successful in the long term, could eventually create a grave threat to humanity and to most life on Earth.Fortunately, the threat is distant, and avoidable—but only if we have common knowledge of it.What follows is an explanation of the threat, what we can do about it, and my comments.Background: chiralityGlucose, a building block of sugars and starches, looks like this:Adapted from WikimediaBut there is also a molecule that is the exact mirror-image of glucose. It is called simply L-glucose (in contrast, the glucose in our food and bodies is sometimes called D-glucose):L-glucose, the mirror twin of normal D-glucose. Adapted from WikimediaThis is not just the same molecule flipped around, or looked at from the other side: it’s inverted, as your left hand is vs. your right.Some molecules, such as water or glycerol, are symmetric, and so there is no distinction between their “left-handed” and “right-handed” versions. But many, like glucose, have this asymmetry that gives them a mirrored twin. Such asymmetric molecules are called chiral.Chiral molecules include not only glucose, but proteins, DNA and RNA. In short, life is chiral.Mirror lifeAll life on Earth, from bacteria to humans, has matching chirality, reflecting our common biological ancestry: all cells use left-handed amino acids, right-handed nucleotides, etc. But there is no known reason why an entire cell, organism, or ecosystem could not exist with the opposite chirality for each type of molecule. Call it “mirror life.”Mirror life would interact with Earth life in strange ways, because every subsystem in our bodies is tuned to Earth chirality. Proteins evolved to fit other molecules, and would fit a mirror molecule the way your left shoe fits your right foot. Mirror food, for instance, might be less digestible to animals, because the enzymes that break down our food are chiral.And, crucially, mirror cells might be largely invisible to the immune system of every organism on the planet.The threatA mirror virus would likely be harmless to us: it would be incompatible with our cells’ machinery, and thus unable to replicate in our bodies. A mirror bacterium, on the other hand, could be a lethal threat, even if it is a mirror of a species that is normally harmless.Mirror bacteria could enter the body via the eyes, nose, or mouth, or through wounds, all of which happen frequently with normal bacteria. They would not necessarily need any special adhesion to our cells in order to do this.Once inside, mirror bacteria might evade most of our immune defenses. They would be less vulnerable to the enzymes in our bodily fluids, such as lysozyme, that normally break down bacterial proteins. The surface proteins of mirror bacteria would likely not be recognized by our immune cells, and so much of the immune system might not trigger. They might not be broken down by enzymes in order to present antigens to T-cells, and so might not stimulate antibody production.In the body, mirror bacteria could feed on achiral molecules such as glycerol and ammonia. E. coli, for instance, will replicate in growth media containing only achiral nutrients; mirror E. coli would do the same. With the right genes, mirror bacteria could even feed on the glucose in our bodies (there are Earth bacteria that can use mirrored L-glucose; therefore their mirror twins would be able to use normal D-glucose). Unlike humans, bacteria do not require certain essential amino acids, instead synthesizing what they need from simpler molecules in the environment.Mirror bacteria might thus have free reign within the bodies not just of humans but also much of multicellular life on Earth. They would have no natural predators. They would be immune to existing bacteriophages. They would be an invasive species colonizing what might be, to them, an untouched environment.The pathology of a mirror infection is unclear. The bacteria and their biomolecules would have limited interaction with our own cells. But they could produce toxic byproducts, and in any case, the unchecked growth of bacterial cells within the body could plausibly lead to a sepsis-like condition that could easily be fatal.Defense would be difficult and severely limitedWe could mount multiple forms of defense against mirror bacteria. First-line defenses such as hand-washing, sterilization, and gloves or masks would still be effective. We might be able to treat infections with mirror antibiotics. We might be able to immunize people, pets, livestock and crops with mirror vaccines, or to genetically engineer crops to have natural resistance. We might be able to engineer mirror bacteriophages.Most of these measures, however, would only protect treated individuals or specific crops. It would be extremely difficult, likely impossible, to protect the ecosystem as a whole. In a world overrun by mirror bacteria, the best case for humanity might be that only our species continues, along with a small number of animal and plant species that we need to survive. In any case, the biosphere would be irreparably altered, in the greatest extinction event of the last two billion years.Are we sure?The threat of mirror bacteria is a prediction by a group of scientists, including experts in synthetic biology, evolutionary biology, immunology, and biosecurity. The prediction is not certain.Chirality is real. Mirror biomolecules, such as L-glucose, are real and exist in nature. Larger mirror biomolecules have been created in the lab, and there is experimental evidence that mirror proteins do not reliably trigger certain immune responses. Mirror cells, however, including bacteria, have never been known to exist, and have never been studied directly.It’s conceivable that mirror bacteria would present a much lesser threat, or no significant threat. It’s also conceivable, but less likely, that mirror life can’t exist at all for some reason.Indeed, the threat is not obvious, even to experts, even though the possibility of mirror life has been known for a long time. In a WIRED article from 2010, for instance, MIT biologist George Church was asked about mirror pathogens and initially replied that they could not infect us. It was only recently that anyone began seriously investigating the threat of immune evasion, and even then, most of the scientists involved were initially skeptical. (Church is now a signatory on today’s article.)However, the scientists on this article have thought through these questions from many angles, applying the best current scientific knowledge across physics, chemistry, biology, and health, and the disaster scenarios are simply too plausible for comfort.Mirror life is a long-term goal of some scientific researchMirror life hasn’t evolved on Earth in the last 3.5 billion years, so why worry about it now? Because the creation of mirror life is a long-term goal of multiple research labs investigating it.Fortunately, we are not close to this happening. The technology to create mirror life does not currently exist. Even if we put in a massive effort and concentrated tremendous resources on it, it would take a decade.Further, let me stress that this is a minor subfield of biological research, and not heavily funded. So on our present course, it is decades away. (That is, setting aside any significant acceleration of biological research from AI or other technologies.)Still, the fact is that some researchers have been on this path. Like most scientists who had considered the question, they did not see the risks, thinking that mirror life would have limited interaction with us and therefore be harmless. They are not to be blamed for this. In fact, after a more in-depth discussion, many of them have signed today’s article.What to do?The article recommends that humanity avoid creating mirror bacteria, even as a scientific experiment, no matter how tight the biosecurity around it (which can never be perfect). Funders should not fund such research; governments should even ban it.This is a simple cost-benefit calculation. On the cost side, the threat is plausible, and the potential damage incalculable. Thus, the risk is immense. On the benefit side, there is no crucial goal for humanity that is known to be enabled by mirror life. Restricting this research would not fundamentally impede progress in biology or bioengineering generally.Not all forms of mirror biology would even need to be restricted. For instance, there are potential uses for mirror proteins, and those can be safely engineered in the lab. The only dangerous technologies are the creation of full mirror cells, and certain enabling technologies which could easily lead to that (such as the creation of a full mirror genome or key components of a proteome).In short, by pruning off a relatively small branch of the tech tree, we can avoid a true existential risk.The article also recommends research to develop surveillance and countermeasures, in case humanity ever does encounter mirror bacteria. This research can be advanced significantly without creating full mirror cells.We have time to reactGiven that the threat is relatively distant, no immediate action is needed. We have time to discuss it thoroughly, among a wider set of participants. The article released today is meant to be the beginning of that wider conversation, not a call to urgent action.The above is largely summarized from the Science article, supplemented by the accompanying technical report and conversations with some of the researchers involved. What follows are purely my own thoughts.The far futureI agree with the article’s recommendations for the foreseeable future. However, I can imagine the cost-benefit calculus changing in the long term, such that it would make sense to reconsider synthesizing mirror life.On the cost side, future technologies could improve biocontainment. Imagine, for instance, a space-based bio lab, fully roboticized, in orbit around the Sun. Suppose this lab can accept shipments of materials, but nothing ever leaves it. Such a lab, separated by more than 1 AU from Earth, might provide sufficient protection for very dangerous experiments.More speculatively, a mature and globally deployed nanotechnology might make control of the ecosystem possible, in which case mirror bacteria would pose no threat.On the benefit side, we might someday decide that research on mirror organisms is necessary—before we encounter them in the wild, on other planets or their moons. While there is no evidence of advanced civilizations elsewhere in the observable universe, it is entirely possible that the universe is chock-full of bacterial life. And if the particular chirality of Earth life is a biohistorical accident, then there could be entire planets full of mirror life. Better to learn about it deliberately, in a lab, under controlled conditions, then to encounter it accidentally, and without warning.Again, all of these are far-future speculations, which shouldn’t affect decisions we make in the present.Optimism, pessimism, and progressThis article could be considered “pessimistic.” It considers an unproven threat, generated by uncreated technology, which might exist decades from now.An “optimistic” response might be to downgrade the risk. Maybe we could easily defend against any threat, maybe we’d contain it in the lab, maybe it wouldn’t even be a threat, maybe we’ll never even create it, maybe it’s actually impossible.I advocate neither optimism nor pessimism, but realism and solutionism. We should try to see reality, including risks, as clearly as possible, and we should actively steer towards solutions to any problems we see.I am curious to know what the reaction to this issue will be from those who self-identify as techno-optimists or as “accelerationists.” But from a techno-humanist viewpoint, I think this is one small corner of the universe that humanity should simply not explore right now, for our own sake. We can achieve the glorious techno-abundant future without opening this particular door—and for the foreseeable future, maybe only by not opening it.Thanks to Kevin Esvelt for briefing me on this report, and to him and James Wagstaff for answering my questions about it.Discuss","pubDate":"Sat, 14 Dec 2024 19:57:09 GMT"}