{"id":"JBR6AF9Gusv4u6Fwo","title":"Laziness death spirals","link":"https://www.lesswrong.com/posts/JBR6AF9Gusv4u6Fwo/laziness-death-spirals","published":1729033876000,"description":"Published on September 19, 2024 3:58 PM GMTI’ve claimed that Willpower compounds and that small wins in the present make it easier to get bigger wins in the future. Unfortunately, procrastination and laziness compound, too.You’re stressed out for some reason, so you take the evening off for a YouTube binge. You end up staying awake a little later than usual and sleeping poorly. So the next morning you feel especially tired; you snooze a few extra times. In your rushed morning routine you don’t have time to prepare for the work meeting as much as you’d planned to. So you have little to contribute during the meeting. You feel bad about your performance. You escape from the bad feelings with a Twitter break. But Twitter is freaking out. Elon Musk said what?&nbsp;Everyone is weighing in. This is going to occupy you intermittently for the rest of the day. And so on.Laziness has a kind of independent momentum to it. When you’re having a day like the above, even if you consciously commit to getting back on track, the rut tends to find its way back to you within a couple of hours. Keep this up for a few days and your sleep is utterly messed up, and you walk around in a fog. Keep it up for a week or two and you’re fully off your workout routine. In a month or two, you might have noticeably fallen behind on work; you might be absent from your social life; you might’ve visibly gained fat or lost muscle; you can no longer feel excited about your personal goals because they’re behind a pile of mundane tasks you need to catch up on first. And so on.How do we stop the vicious circle?I’m spiraling! I’m spiraling!When you’re in a&nbsp;laziness death spiral, it’s hard to do anything&nbsp;deliberate. The first and most important step, which does take&nbsp;some&nbsp;willpower but not a lot, is to acknowledge, “I’m in a laziness death spiral today.”If you don’t acknowledge it, here’s what happens: You vaguely notice you you’ve been wasting time today; you feel a twinge of guilt, so you quickly decide, “I’m going to turn the rest of the day around, starting right now.” And does that work?Often it doesn’t! Sure, after a small lapse you can just get back on track, but if enough laziness momentum has built up, a momentary reaction doesn’t cut it. Deciding things quickly, in response to negative emotions, is exactly how you got into this situation! You’re going to turn it around on a whim? You’ll have a different whim in the next hour; what then? You need to take a step back and get your mind outside of the problem.Do what you canThe next three sections are three different courses of action you can take to get out of a laziness death spiral. One of them is clearly preferable, but I’m writing the alternatives, too. When you’re in a low-willpower state, it’s often bad to attempt the very best solution—the farther you reach, the harder you can fall. Building a base of “small wins” is the reliable way to repair your willpower. If you start something lofty and then bail on it, you’re doing real damage: logging another willpower failure and associating that “very best solution” with failure.Here are the moves:A) Emergency recoveryIf you’re in a laziness spiral and you need&nbsp;to get out of it&nbsp;right now, there are some measures you can take that, while effective, are not ideal. They are unsustainable, promote bad habits, or are just generally unhealthy. But sometimes the need is there: maybe you have a deadline fast approaching (and the deadline itself isn’t enough to snap you into action); maybe your friends or family need you to take care of something today; maybe you were in the middle of an awfully lazy day and a once-in-a-lifetime opportunity came up, and you just can’t focus enough to act on it.Disclaimer: I believe that&nbsp;in a well planned life, none of these should ever be necessary. I’m only writing them because we are not perfect.Motivational videos: It’s a whole genre of YouTube/Instagram content. They make tons of this stuff. The male-coded ones have clips of men lifting weights and climbing mountains set to audio of David Goggins or CT Fletcher yelling at you to get to work. The female-coded ones, I’m led to believe, feature beautiful and confident women giving positive affirmations. These videos do work; they inspire a certain emotional state in their target audience, and that state provides the mental energy to take immediate action. The downside is that you naturally build up a tolerance to emotional triggers over time; you can’t watch the same video every day before your workout and expect it to feel the same. The other downside is that they might not even last very long. Your emotional state will change again, maybe sooner than you think.Music: Listen to the songs that you associate with action. Similarly, this inspires an emotional state. I find that here, too, the effect is short-lived, unless I keep the playlist going (and sometimes you can’t have music playing while focusing on the work you need to do).Drugs: Ingest enough caffeine to change your headspace. Or take Adderall or some variant. Don’t listen to me, I don’t know anything about drugs. Obviously you’ll build up a tolerance over time and obviously it’s very bad to depend on a substance to perform.B) Natural recoveryWhat’s the easiest way to get out of a spiral, without doing anything drastic or unusual? I find there are times when it’s naturally easier to change course. And if you wait for them to come, you can pull yourself out of a spiral without a herculean effort of willpower. Then you can analyze what went wrong and avoid those circumstances in the future.Wait for a reset pointFor me, waking up in the morning is a mental reset; nothing from my headspace the night before really makes it to the morning. Now, bad habits from the night before might’ve given me less sleep, or poor sleep, but I find that my willpower is usually fresh. So when I’m having an off day, and I notice, I might just call the rest of the day a wash and start planning what I’m going to do tomorrow. Even as I’m caught up in lazy activity, I’m making specific plans to be productive tomorrow. The fact that it’s at a later point in time means I’m thinking about it for a while, putting more mental energy into the plan. That’s the opposite of “deciding on a whim.”It also gives me time to realize, wow, I really don’t enjoy being lazy. In my New-Year’s resolution rant I talked about this effect. For those who continually fail their New Year’s resolutions:Got a project you’ve been excited about but afraid to start? Don’t even think about it—don’t enjoy the fantasy of it; stop telling your friends about it; pretend you never had that intention in the first place.In other words,&nbsp;aggressively&nbsp;run&nbsp;away&nbsp;from your goals, and reflect on how miserable it is to live that way. The reflection is crucial: if you’re self-forgetful / not mindful about it, you’ll risk staying in that state. Do it for a week or two, reflect on how much it sucks, and in doing so you’ll condition your mind to view the goal as a valuable opportunity to escape that misery (which it is).Sometimes you cognitively “want” something, but there’s just no mental energy behind that want. You know some goal or idea is good for you, but you don’t&nbsp;feel, subconsciously and emotionally, that it’s good for you. Sometimes you need to feel it. So, you should go completely without the thing for a while, and allow yourself to feel irritated by that condition.This is actually a sneaky form of self-control. When you notice you’ve been lazy, your next impulse is to dash into some “productive” task to start “making up for” the lost time. But this reinforces a habit of acting on impulses. In a way, it’s more difficult to remain in the state you’re in and accept the loss. A person who can do that can also wake up the next day and be extremely productive.What are your natural reset points? Maybe it’s the morning. Maybe it’s when you go to a specific location. Maybe it’s a specific day of the week. Identify your next reset point, and then wait patiently for it to come.Analyze the circumstances that caused itThe other part of the natural recovery is to notice what started your spiral, so you can avoid it in the future. You do this analysis as soon as you’re at a reset point. Look at your recent activity and ask, “Where did I go off the rails earlier?”after a chess game, i open the game review, wondering: which move lost me the game? was i winning at any point?i need life game review at the end of every day. when did my day go awry? was i on pace to have a productive day at any point?— monk (@mechanical_monk)&nbsp;August 10, 2023In doing that review, you’ll discover how far back the laziness death spiral goes. “Well it’s cause I got up late today. Why was I on my phone so late last night? Oh yeah, that other thing…”For me, when I get down to the real original cause, it’s often something very mundane that just happened to occur at the perfect moment to throw me off. A few examples:Food: I ate a huge meal and it put me into a food coma that I wasn’t prepared for.Media: I watched something a little too attention-grabby, a little too early in the day. On the spectrum from art to entertainment—where the art requires more mental energy to enjoy but delivers richer value, and entertainment can be enjoyed passively but is cheap value—I mostly only slide toward the entertainment side throughout the day. So for example if I play a video game at 6pm, there’s very little chance I’m going to be consuming something thoughtful and complex at 9pm.Sleep: This is actually more nuanced than just “I didn’t get enough”: waking up at the wrong point in your sleep cycle makes you feel much groggier. In any case, if I wake up feeling off and I don’t immediately need to be somewhere, I’ll drag it out, snoozing. And that doesn’t make the grogginess go away. And although I may not miss any explicit plans, it puts me on a lazy bent.Decision spirals: I don’t necessarily believe in&nbsp;decision fatigue, but there’s a certain kind of decision that’s absolutely devastating for my productivity. It’s when I have to pick between two pretty balanced choices, but there are many little details to consider on each side. The longer you spend thinking about it, the more dynamics reveal themselves. So it’s kind addicting; you hope that if you just view the problem from one more angle, something stark will appear and make the choice easy. But the more time you spend, the more cost you have sunk into it, which makes it feel all the more important that you decide optimally when you finally decide! In short, Choices are bad.&nbsp;So, that’s the natural recovery. It works pretty well, but the downside is that you can get knocked off again. You might know the exact circumstantial triggers that caused a spiral last time, but different ones will come up next time. Some you can mitigate, but some will keep coming at you because, as I said, they’re mundane. And that makes me again wonder how something as ordinary as a big meal had such a great effect on my day—perhaps something else is going on.C) Heroic recoveryThe heroic recovery from a laziness spiral is harder and takes longer to work, but it solves the problem in a more complete way. I have enough familiarity with this to see how it works, but not a ton of familiarity. I learn from people more mature than me; every day is a journey.In short, the heroic recovery means deeply analyzing yourself to understand the root cause of your escapes to lazy pastimes—your decisions to&nbsp;dissociate from what’s going on immediately in front of you.Deep psych workThink about the circumstances behind your lapse, like you did in the last section. Then go deeper and analyze exactly why you responded the way you did. Typically, you experienced some minor discomfort, and you escaped from that discomfort by hijacking your attention with a quick-reward activity. What was the minor discomfort? I don’t mean the trigger in physical reality; I mean what was the negative feeling&nbsp;that you cut short? And why?most things I’ve read on here so far are about a particular self-coercion—”making yourself do things”when part of you is afraid/upset/overwhelmed/doesn’t-want-to but you push down those feelings to “do it anyway”seeing now, some ways of “not doing things” are similar— prerat (@prerationalist)&nbsp;November 18, 2020Does the feeling go against your self-image in some way?Some of us can go through decades w/o ever properly coming to terms with our feelings. It is in this sphere that, on reflection, I realized that I actually do know what denial feels like. It’s spookily subtle. “I’m a fun guy” => “that’s not anxiety! Fun guys don’t do anxiety!”— Visakan Veerasamy (@visakanv)&nbsp;August 5, 2019What kind of self-image adjustment would it take to be able to accept that feeling? Who would you be, if you were unconflicted about what you felt in any given circumstance?“When we truly feel comfortable, the desire to improve is natural— no antagonism required, no debt incurred.” – @ChrisLakin_com&nbsp;https://t.co/NQlXA0frXb— Visakan Veerasamy (@visakanv)&nbsp;January 17, 2022This kind of work is best done on a&nbsp;good day&nbsp;when you’re already&nbsp;doing the things you want to do. It’s too important to do on a laziness death spiral day, and it can easily become another part of the spiral: If you’re busy analyzing your reaction to some feeling, you’re not feeling it. You’re still avoiding it.But, if you do enough digging up and sorting things out, you start to re-frame these dissociation triggers, so that even the ones that are out of your control don’t affect you the way they used to.ConclusionThis has been a very heady post. I notice I’m writing very heavily from personal experience here—more than usual—because the dynamics of willpower and laziness and dissociation are very subjective. If it doesn’t seem to match your experience, then disregard it. But if there’s anyone who experiences laziness the same way I do, I might have saved them a lot of trouble.If you liked this post consider subscribing to my Substack, https://truegeneralist.substack.com/.&nbsp;Discuss","pubDate":"Tue, 15 Oct 2024 23:11:16 GMT"}