{"id":"2uJsiQqHTjePTRqi4","title":"Superbabies: Putting The Pieces Together","link":"https://www.lesswrong.com/posts/2uJsiQqHTjePTRqi4/superbabies-putting-the-pieces-together","published":1721183303000,"description":"Published on July 11, 2024 8:40 PM GMTThis post was inspired by some talks at the recent LessOnline conference including one by LessWrong user “Gene Smith”.Let’s say you want to have a “designer baby”. Genetically extraordinary in some way — super athletic, super beautiful, whatever.6’5”, blue eyes, with a trust fund.Ethics aside[1], what would be necessary to actually do this?Fundamentally, any kind of “superbaby” or “designer baby” project depends on two steps:1.) figure out what genes you ideally want;2.) create an embryo with those genes.It’s already standard to do a very simple version of this two-step process. In the typical course of in-vitro fertilization (IVF), embryos are usually screened for chromosomal abnormalities that would cause disabilities like Down Syndrome, and only the “healthy” embryos are implanted.But most (partially) heritable traits and disease risks are not as easy to predict.Polygenic ScoresIf what you care about is something like “low cancer risk” or “exceptional athletic ability”, it won’t be down to a single chromosomal abnormality or a variant in a single gene. Instead, there’s typically a statistical relationship where many genes are separately associated with increased or decreased expected value for the trait.This statistical relationship can be written as a polygenic score — given an individual’s genome, it’ll crunch the numbers and spit out an expected score. That could be a disease risk probability, or it could be an expected value for a trait like “height” or “neuroticism.”Polygenic scores are never perfect — some people will be taller than the score’s prediction, some shorter — but for a lot of traits they’re undeniably meaningful, i.e. there will be a much greater-than-chance correlation between the polygenic score and the true trait measurement.Where do polygenic scores come from?Typically, from genome-wide association studies, or GWAS. These collect a lot of people’s genomes (the largest ones can have hundreds of thousands of subjects) and personal data potentially including disease diagnoses, height and weight, psychometric test results, etc. And then they basically run multivariate correlations. A polygenic score is a (usually regularized) multivariate regression best-fit model of the trait as a function of the genome.A polygenic score can give you a rank ordering of genomes, from “best” to “worst” predicted score; it can also give you a “wish list” of gene variants predicted to give a very high combined score.Ideally, “use a polygenic score to pick or generate very high-scoring embryos” would result in babies that have the desired traits to an extraordinary degree. In reality, this depends on how “good” the polygenic scores are — to what extent they’re based on causal vs. confounded effects, how much of observed variance they explain, and so on. Reasonable experts seem to disagree on this.[2]I’m a little out of my depth when it comes to assessing the statistical methodology of GWAS studies, so I’m interested in another question — even assuming you have polygenic score you trust, what do you do next? How do you get a high-scoring baby out of it?Massively Multiplexed, Body-Wide Gene Editing? Not So Much, Yet.“Get an IVF embryo and gene-edit it to have the desired genes” (again, ethics and legality aside)[3]&nbsp;is a lot harder than it sounds.First of all, we don’t currently know how to make gene edits simultaneously and abundantly in every tissue of the body.Recently approved gene-editing therapies like Casgevy, which treats sickle-cell disease, are operating on easy mode. Sickle-cell disease is a blood disorder; the patient doesn’t have enough healthy blood cells, so the therapy consists of an injection of the patient’s own blood cells which have been gene-edited to be healthy.Critically, the gene editing of the red blood cells can be done in the lab; trying to devise an injectable or oral substance that would actually transport the gene-editing machinery to an arbitrary part of the body is much harder. (If the trait you’re hoping to affect is cognitive or behavioral, then there’s a good chance the genes that predict it are active in the brain, which is even harder to reach with drugs because of the blood-brain barrier.)If you look at the list of 37 approved gene and cell therapies to date,13 are just cord blood cells, or cell products injected into the gums, joints, skin, or other parts of the body (i.e. not gene therapy)14 are blood cells genetically edited in the lab and injected into the bloodstream1 is bone marrow cells genetically edited in the lab and reinjected into the bone marrow2 are intravenous gene therapies that edit blood cells inside the patient1 is a gene therapy injected into muscle to treat muscular dystrophy1 is a gene therapy injected into the retina to treat blindness1 is a gene therapy injected into wounds to modify the cells in the open wound1 is a virus injected directly into skin cancer tumors1 is made of genetically edited pancreatic cells injected into the portal vein of the liver, where they grow1 is a gene therapy injected into the bloodstream that edits motor neuron cells.In other words, almost all of these are “easy mode” — genes are either edited outside the body, in the bloodstream, or in unusually accessible places (wound surfaces, muscles, the retina).We also don’t yet have so-called “multiplex” gene therapies that edit multiple genes at once. Not a single approved gene therapy targets more than one gene; and a typical polygenic score estimates that tens of thousands of genes have significant (though individually tiny) effects on the trait in question.Finally, every known method of gene editing causes off-target effects — it alters parts of the genetic sequence other than the intended one. The more edits you hope to do, the more cumulative off-target effects you should expect; and thus, the higher the risk of side effects. Even if you could edit hundreds or thousands more genes at once than ever before, it might not be a good idea.So if you’re not going to use polygenic scores for gene editing, what can you do to produce a high-scoring individual?Embryo Selection“Produce multiple embryos via IVF, compute their polygenic scores, and only select the highest-scoring ones to implant” is feasible with today’s technology, and indeed it’s being sold commercially already. Services like Orchid will allow you to screen your IVF embryos for things like cancer risk and select the low-risk ones for implantation.While this should work for reducing the risk of disease (and miscarriage!) it’s less useful for anything resembling “superbabies”.Why? Well, a typical cycle of IVF will produce about 5 embryos, and you can choose the best one to implant.If you’re just trying to dodge diseases, you pick the one with the lowest genetic risk score and that’s a win. Almost definitionally, your child’s disease risk will be lower than if you hadn’t done the test and had instead implanted an embryo at random.But if you want a child who’s one-in-a-million exceptional, then probably none of your 5 embryos are going to have a polygenic score that extreme. Simple embryo selection isn’t powerful enough to make your baby “super”.“Iterated Embryo Selection”?In 2013, Carl Shulman and Nick Bostrom proposed that “iterated embryo selection” could be used for human cognitive enhancement, to produce individuals with extremely high IQ.The procedure goes:select embryos that have high polygenic scoresextract embryonic stem cells from those embryos and convert them to eggs and spermcross the eggs and sperm to make new embryosrepeat until large genetic changes have accumulated.The idea is that you get to “reshuffle” the genes in your set of embryos as many times as you want.It’s the same process as selective breeding — start with a diverse population and breed the most “successful” offspring to each other. If you look at the difference between wild and domesticated plants and animals, it’s clear this can produce quite dramatic changes!And of course selective breeding is safer, and less likely to introduce unknown side effects, than massively multiplexed gene editing.But unlike traditional selective breeding, you don’t have to wait for the organisms to grow up before you know if they’re “successful” — you can select based on genetics alone.The downside is that each “generation” still might have a very slow turnaround — it takes 6 months for eggs to mature in vivo and it might be similarly time-consuming to generate eggs or sperm from stem cells in the lab.Moreover, it’s not trivial to “just” turn an embryonic stem cell into an egg or sperm in the lab. That’s known as in vitro gametogenesis and though it’s an active area of research, we’re not quite there yet.Iterated Meiosis?There may be an easier way (as developmental biologist Metacelsus pointed out in 2022): meiosis.His procedure is:take a diploid[4]&nbsp;cell lineinduce meiosis and generate many haploid cell linesgenotype the cell lines and select the best onesfuse two haploid cells together to re-generate a diploid cell linerepeat as desired.Meiosis is the process by which a diploid cell, with two copies of every chromosome, turns into four haploid cells each with a single copy of every chromosome.Which “half” do the daughter cells get? Well, every instance of meiosis shuffles up the genome roughly randomly, determining which daughter cell will get which genes.The meiosis-only method skips the challenges of differentiating a stem cell into a gamete, or growing two gametes into a whole embryo. It’s also faster — meiosis only takes a few hours.The hard part, as he points out, is inducing meiosis to begin with; back in 2022 nobody knew how to turn a “normal” diploid somatic cell into a bunch of haploid cells.Recently, he solved this problem! Here’s the preprint.It’s a pretty interesting experimental process; basically it involved an iterative search process for the right set of gene regulatory factors and cell culture conditions to nudge cells into the meiotic state.what are the genes differentially expressed in cells that are currently undergoing meiosis?in a systematic screen, what transcription factors upregulate the expression of those characteristic “meiosis marker” genes?let’s test different combinations of those putative meiosis-promoting transcription factors, along with different cell culture media and conditions, to see which (if any) promote expression of meiosis markersof the cells that we could get to express our handful of meiosis markers, which of them are actually meiotic, i.e. have the whole same expression profile as “known good” meiotic cells?what gene regulatory factors are responsible for those successfully-meiotic cells? let’s add those to the list of pro-meiotic factors to add to the culture medium.do we get more meiotic cells this way? do they look meiotic morphologically under the microscope as well as in their gene expression?Yes? ok then we have a first draft of a protocol; let’s run it again and see how the cells change over time and what % end up meiotic (here it looks like about 15%)This might generalize as a way of discovering how to transform almost any cell in vitro into a desired cell fate or state (assuming it’s possible at all.) How do you differentiate a stem cell into some particular kind of cell type? This sort of iterative, systematic “look for gene expression markers of the desired outcome, then see what combinations of transcription factors make cells express em” process seems like it could be very powerful.Anyhow, induced meiosis in vitro! We have it now.That means we can now do iterated meiosis.At the end of the iterated meiosis process, what you have is a haploid egg-like cell with an “ideal” genetic profile (according to your chosen polygenic score, which by stipulation you trust.)You’ll still have to fuse that haploid sort-of-egg with another haploid cell to get a diploid cell, for the final round.And then you’ll have to turn that diploid cell into a viable embryo…which is itself nontrivial.Generating Naive Pluripotent CellsYou can’t turn a random cell in your body into a viable embryo, even though a skin cell is diploid just like a zygote.A skin cell is differentiated; it only makes stem cells. By contrast, a zygote is fully pluripotent; it needs to be able to divide and have its descendants grow into every cell in the embryo’s body.Now, it’s been known for a while that you can differentiate a typical somatic cell (like a skin cell) into a pluripotent stem cell that can differentiate into different tissues. That’s what an induced pluripotent stem cell (iPSC) is!The so-called Yamanaka factors, discovered by Shinya Yamanaka (who won the Nobel Prize for them) are four transcription factors; when you culture cells with them, they turn into pluripotent stem cells. And iPSCs can differentiate into virtually any kind of cell — nerve, bone, muscle, skin, blood, lung, kidney, you name it.But can you grow an embryo from an iPSC? A viable one?Until very recently the answer was “only in certain strains of mice.”You could get live mouse pups from a stem cell created by growing a somatic mouse cell line with Yamanaka factors; but if you tried that with human cell lines you were out of luck.In particular, ordinary pluripotent stem cells (whether induced or embryonic) typically can’t contribute to the germline — the cell lineage that ultimately gives rise to eggs and sperm. You can’t “grow” a whole organism without germline cells.You need naive pluripotent stem cells to grow an embryo, and until last year nobody knew how to create them in vitro in any animal except that particular mouse strain.In December 2023, Sergiy Velychko (postdoc at the Church Lab at Harvard) found that a variant of one of the Yamanaka factors, dubbed SuperSOX, could transform cell lines into naive pluripotent stem cells, whether they were human, pig, cow, monkey, or mouse. These cells were even able to produce live mouse pups in one of the mouse lines where iPSCs normally can’t produce viable embryos.“Turn somatic cells into any kind of cell you want” is an incredibly powerful technology for tons of applications. you can suddenly do things like:grow humanized organs in animals, for transplantsbreed lab animals with some human-like organs to make them better disease models for preclinical researchallow everybody (not just people who happen to have banked their own cord blood) to get stem cell transplants that are a perfect match — just make em from your own cells!Also, if you combine it with induced meiosis, you can do new reproductive tech stuff.You can take somatic cells from two (genetic) males or females, induce meiosis on them, fuse them together, and then turn that cell into a naive induced pluripotent stem cell and grow it into an embryo. In other words, gay couples could have children that are biologically “both of theirs.”And, as previously mentioned, you can use iterative meiosis to create an “ideal” haploid cell, fuse it with another haploid cell, and then “superSOX” the result to get an embryo with a desired, extreme polygenic score.What’s Missing?Well, one thing we still don’t know how to do in vitro is sex-specific imprinting, the epigenetic phenomenon that causes some genes to be expressed or not depending on whether you got them from your mother or father.This is relevant because, if you’re producing an embryo from the fusion of two haploid cells, for the genes from one of the parent cells to behave like they’re “from the mother” while the genes from the other behave like they’re “from the father” — even though both “parents” are just normal somatic cells that you’ve turned haploid, not an actual egg and sperm.This isn’t trivial; when genomic imprinting goes wrong we get fairly serious developmental disabilities like Angelman Syndrome.Also, we don’t know how to make a “supersperm” (or haploid cell with a Y-chromosome, to be more accurate) from iterated meiosisThat’s the main “known unknown” that I’m aware of; but of course we should expect there to be unknown-unknowns.Is your synthetic “meiosis” really enough like the real thing, and is the Super-SOX-induced “naive pluripotency” really enough like the real thing, that you get a healthy viable embryo out of this procedure? We’ll need animal experiments, ideally in more than one species, before we can trust that this works as advertised. Ideally you’d follow a large mammal like a monkey, and wait a while — like a year or more — to see if the apparently “healthy” babies produced this way are messed up in any subtle ways.In general, no, this isn’t ready to make you a designer baby just yet.And I haven’t even touched on the question of how reliable polygenic scores are, and particularly how likely it is for an embryo optimized for an extremely high polygenic score to actually result in an extreme level of the desired trait.[5]But it’s two big pieces of the puzzle (inducing meiosis and inducing naive pluripotency) that didn’t exist until quite recently.Exciting times!^and my own ethical view is that nobody’s civil rights should be in any way violated on account of their genetic code, and that reasonable precautions should be taken to make sure novel human reproductive tech is safe.^especially for controversial traits like IQ.^it’s famously illegal to “CRISPR” a baby.^most cells in the human body are “diploid”, having 2 copies of every chromosome; only eggs and sperm are “haploid”, having 1 copy of every chromosome.^“correlation is not causation” becomes relevant here; if too much of the polygenic score is picking up on non-causal correlates of the trait, then selecting an embryo to have an ultra-high score will be optimizing the wrong stuff and won’t help much.&nbsp;Also, if you’re selecting an embryo to have an even higher polygenic score than anyone in the training dataset, it’s not clear the model will continue to be predictive. It’s probably not possible to get a healthy 10-foot-tall human, no matter how high you push the height polygenic score. And it’s not even clear what it would mean to be a 300-IQ human (though I’d be thrilled to meet one and find out.)Discuss","pubDate":"Wed, 17 Jul 2024 02:28:23 GMT"}