{"id":"KgFNwBuaDpfGSJktM","title":"A Dozen Ways to Get More Dakka","link":"https://www.lesswrong.com/posts/KgFNwBuaDpfGSJktM/a-dozen-ways-to-get-more-dakka","published":1715988530000,"description":"Published on April 8, 2024 4:45 AM GMTAs&nbsp;the dictum goes, “If it helps but doesn’t solve your problem, perhaps you’re not using enough.” But I still find that I’m sometimes not using enough effort, not doing enough of what works, simply put, not using enough dakka. And if reading one post isn’t enough to get me to do something… perhaps there isn’t enough guidance, or examples, or repetition, or maybe me writing it will help reinforce it more. And I hope this post is useful for more than just myself.Of course, the ideas below are not all useful in any given situation, and many are obvious, at least after they are mentioned, but when you’re trying to get more dakka, it’s probably worth running through the list and considering each one and how it applies to your actual problem. And more dakka won’t solve every problem - but if it’s not working, make sure you tried doing enough before assuming it can’t help.So if you’re doing something, and it isn’t working well enough, here’s a dozen ways to generate more dakka, and how each could apply if you’re a) exercising, or b) learning new mathematics.A Dozen WaysDo it again.Instead of doing one set of repetitions of the exercise, do two.If you read the chapter once, read it again.Use more.If you were lifting 10 pounds, lift 15.If you were doing easy problems, do harder ones.Do more repetitions.Instead of 10 repetitions, do 15.If you did 10 problems on the material, do 15.&nbsp;Increase intensity.Do your 15 repetitions in 2 minutes instead of 3.If you were skimming or reading quickly, read more slowly.Schedule it.Exercise at a specific time on specific days. Put it on your calendar, and set reminders.Make sure you have time scheduled for learning the material and doing problems.Do it regularly.Make sure you exercise twice a week, and don’t skip.Make sure you review what you did previously, on a regular basis.Do it for a longer period.Keep exercising for another month.Go through another textbook, or find more problem sets to work through.Add types.In addition to push-ups, do bench presses, chest flyers, and use resistance bands.In addition to the problem sets, do the chapter review exercises, and work through the problems in the chapter on your own.Expand the repertoire.Instead of just push–ups, do incline push ups, loaded push-ups, and diamond push-ups.Find (or invent!) additional problem types; try to prove things with other methods, find different counter-examples or show why a relaxed assumption means the result no longer holds, find pre-written solutions and see if you can guess next steps before reading them.Add variety.Do leg exercises instead of just chest exercises. Do cardio, balance, and flexibility training, not just muscle building.&nbsp;Do adjacent types of mathematics, explore complex analysis, functional analysis, and/or harmonic analysis.Add feedback.Get an exercise coach to tell you how to do it better.Get someone to grade your work and tell you what you’re doing wrong, or how else to learn the material.Add people.Have the whole team exercise. Find a group, gym, or exercise class.Collaborate with others in solving problems. Take a course instead of self-teaching. Get others to learn with you, or teach someone else to solidify your understanding.Bonus NotesFor the baker’s dozen, in addition to Dakka, make it easier in other ways. Listen to music if it helps, remove things that make it harder or distract you, make sure you have the right equipment, books, and space, find a more convenient place to do it, and get people to reinforce your work positively.And there is a secret 14th technique, which is to figure out if what you’re doing is the right way to accomplish your goal; it might improve some metric, but not accomplish what you really care about. If you still aren’t getting the job, make sure it’s not because of something other than your physical appearance or math ability. If you’re not losing weight, exercising more often doesn’t help. And if you’re getting stuck on the math, or feel that you can’t understand it, make sure you understand all of the prerequisites well enough.Hopefully, this post is helpful. If it wasn’t, of course, you might try reading it again, reading it more slowly, rereading Zvi’s original post, thinking of additional examples yourself, coming up with another method for getting more dakka and generating examples for the listed domains, coming up with a new domain and trying to figure out what might qualify as more dakka under each example, using other rationality techniques to supplement dakka, explain this to someone else, or figure out if there’s some other reason more dakka isn’t working.DisclaimerIf you’re still not sure, ask your rationalist guru whether more dakka is right for you. If more dakka causes headaches, anxiety, loss of sleep, excess posting on lesswrong, or increases existential risk, discontinue more dakka immediately and seek amateur advice.Discuss","pubDate":"Fri, 17 May 2024 23:28:50 GMT"}