{"id":"sAcPTiN86fAMSA599","title":"What Goes Without Saying","link":"https://www.lesswrong.com/posts/sAcPTiN86fAMSA599/what-goes-without-saying","published":1735331562000,"description":"Published on December 20, 2024 6:00 PM GMTThere are people I can talk to, where all of the following statements are obvious. They go without saying. We can just “be reasonable” together, with the context taken for granted.And then there are people who…don’t seem to be on the same page at all.1. There’s a real way to do anything, and a fake way; we need to make sure we’re doing the real version.Concepts like Goodhart’s Law, cargo-culting, greenwashing, hype cycles, Sturgeon’s Law, even bullshit jobs[1]&nbsp;are all pointing at the basic understanding that it’s easier to seem good than to be good, that the world is full of things that merely appear good but aren’t really, and that it’s important to vigilantly sift out the real from the fake.This feels obvious! This feels like something that should not be contentious!If anything, I often get frustrated with chronic pessimists who cry “fake” or “sellout” or “bullshit job” about everything popular or glossily presented, or everything whose value isn’t obvious to them.But then sometimes I meet people who talk as though they aren’t tracking “how do we make sure we’re tackling the main problem?” or “well, most things in this space are {unreplicable, failures, trivial, biased, error-prone, etc} so how are we ensuring we select for the few actually-good ones?”I don’t get the casual verbal signals that show they even see the world in terms of a few islands of brilliant color in a sea of dismal gray boring pointless stuff.2. It is our job to do stuff that’s better than the societal mainstream.Pretty much everyone understands that there are Problems with society, though they disagree on what they are and what should be done about them.On the other hand, I see a lot of people who orient primarily towards “this problem isn’t going to be solved until Everyone changes” and aren’t focused at all on “well, in my local context, I’m going to make sure I/we do better than that.”Like…ok, education sucks; so, are you building a good school, or picking out a good one for your kids, or being a good teacher? Sometimes even when the answer is yes, the person would much rather talk in really depressing collective terms that invalidates what anyone can do constructively on an attainable scale.And, sometimes, people do things with their personal life choices that they will tell you are dumb, because Society. And I’m like…you know, you could just not do the popular thing, but instead do what you think is best? If it’s hard because you need support from other people, that’s one thing, but then we can start having that discussion, which is much more useful than the “oh no Society” discussion.Then again, occasionally I meet people who…do not get that the societal default is a problem.If you do what everyone else does, you’ll get the same results as everyone else. Obviously.But if you’re trying to “make a difference”, that means you have to do something different. And some people don’t seem to get this? They don’t have the mental image of fading by default into an unimpressive morass of “what everyone else is doing”, and a desire to avoid that fate. The default seems fine to them.3. Pointless busywork is bad.Obviously, one man’s pointless busywork is another’s crucial process. People can disagree about what activities are necessary vs. unnecessary, and that’s fine.But it feels like it should be intuitive that there are probably some things an organization is doing needlessly, and that those things should be cut.And not everybody feels that way.Some people do not have the same intuition that pointless busywork is boring and demotivating.[2]&nbsp;Some people do not have the intuition that organizations should run as efficiently as possible and avoid wasting time or resources.Some people fundamentally aren’t tracking “do we absolutely need this step, or can we skip it?” and do not even feel the need to justify or be sheepish if they are spending a lot of time on meetings, documentation, or internal process.4. If we’re doing something worthwhile, not literally everyone will like it.Being “agreeable” gets a bad rap; I do place value on good manners, good feelings, and social harmony. But c’mon. If you seek universal consensus on everything, you will never get anything interesting done.Also, while we all like social approval, you’ve gotta understand on some level that it’s immature to make decisions for the sake of being popular, right? It’s a temptation, a vice, not an actual valid priority.Unfortunately, there are people who actually think that universal consensus takes top priority and that there’s nothing wrong with being a human weathervane.5. It’s important to have an honorable purpose; commercial purposes can be honorable.I’ve met people who are genuinely weirded out by the idea that a regular, for-profit business could count as “the good guys”, but c’mon! If you are providing a valuable good or service, you are making the world incrementally better! The grocery store and the fruit truck and the farm are all making honest, helpful contributions!And, by contrast, things like nepotism or zero-sum office politics or deceptive marketing are not honorable. I occasionally meet people who think it’s incredibly naive that I’m like “but isn’t the purpose of your organization…to produce this thing of value? isn’t it…bad…to divert resources away from that? if you’re in a dysfunctional organization where everything is about private fiefdoms instead of getting things done…why not…leave?”I happen to think that a reasonable moral standard is one where you can, actually, Just Be Good, cover your bases and not have too much to worry about and have a happy life overall. You can just…always do what you think is right when that’s feasible…and stop believing you’re obliged to do things that aren’t feasible for you?But yeah, there are people who aren’t going to care whether e.g. the airplane company makes good airplanes, or consider that sort of thing a “moral” issue at all.6. Remember to include the outsiders (and all young people start out as outsiders).This is a strongly felt intuition I have, that I’ve learned not everybody shares.Can “some rando” who has talent but no polish and is naive in the Way of the World possibly get that job, that grant, etc? Is the process accessible to him? Or is it all “you gotta know a guy” behind-the-scenes patronage networks?Are you sharing knowledge to the greatest extent possible, with strangers, with foreigners, with self-taught people?Are you, without breaking confidences, taking every opportunity to spill the beans about how the world really works to people who haven’t (yet) had the opportunity to see what you’ve seen?Or are you pulling the ladder back up after you?If someone seems naive, are you laughing at him behind his back, or are you trying to tell him what you know?There are valid reasons for secrecy, but you gotta understand that knowledge sharing is important and every refusal to share comes at a cost.And some people aren’t tracking this as a priority at all. As far as they’re concerned, everybody who matters is going to get informed through personal and institutional relationships, and people who are isolated from those networks and get their information from reading publicly-available text (typically online) are just not an important target demographic. Which makes me sad, because usually that’s my demographic, and my friends’, and I think there’s a lot of talent there!What am I even saying?This is less filtered than my usual posts and I don’t really have a point beyond giving voice to my own priorities.I used to be really irritated with a constant drumbeat of messages about “agency” and “ambition” and a rejection of “conformism”, because it seemed to be preaching an extreme ideal that I couldn’t live up to.But the thing is, I was already on board with “you should try to do cool things” and “you should think for yourself” and “some things worth doing are hard.” Those are pretty normal baseline assumptions! I just didn’t like the guilt-trippy, shaming, aggressively superior tone that can come across in popular online writing.And then I realized…oh wait. Some people are really non-agentic, unambitious, and obsessed with social approval, and don’t share my baseline assumptions. I don’t like the extreme on this axis, any more than I like the extreme “nobody and nothing in this world is good enough for me, the Grumpy Ubermensch” types.It’s good to…try to do cool stuff in real life? people do it? people can have such creative hobbies and self-made family traditions and fascinating work, they sparkle, and there are a lot of different ways to sparkle.^I disagree with Graeber’s ideas about which jobs are bullshit (actuaries?!?) but the basic intuition that our society includes a lot of needless busywork is an example of the thing I’m pointing at.^My best guess is that they are pretty equally “motivated” to do work whether it seems important to an ultimate goal or not? Like, the opposite of “I can work super hard if I care, and not at all if I don’t.” But admittedly I don’t understand the psychology at all.Discuss","pubDate":"Fri, 27 Dec 2024 20:32:42 GMT"}