{"id":"DiiLDbHxbrHLAyXaq","title":"Why people like your quick bullshit takes better than your high-effort posts","link":"https://www.lesswrong.com/posts/DiiLDbHxbrHLAyXaq/why-people-like-your-quick-bullshit-takes-better-than-your","published":1764534174000,"description":"Published on November 28, 2025 8:12 PM GMTRight now I’m coaching for Inkhaven, a month-long marathon writing event where our brave residents are writing a blog post every single day for the entire month of November.And I’m pleased that some of them have seen success – relevant figures seeing the posts, shares on Hacker News and Twitter and LessWrong. The amount of writing is nuts, so people are trying out different styles and topics – some posts are effort-rich, some are quick takes or stories or lists.Some people have come up to me – one of their pieces has gotten some decent reception, but the feeling is mixed, because it’s not the piece they hoped would go big. Their thick research-driven considered takes or discussions of values or whatever, the ones they’d been meaning to write for years, apparently go mostly unread, whereas their random-thought “oh shit I need to get a post out by midnight or else the Inkhaven coaches will burn me at the stake” posts[1]&nbsp;get to the front page of Hacker News, where probably Elon Musk and God read them.It happens to me too – some of my own pieces that took me the most effort, or that I’m proudest of, have zero notable comments or responses. I’m not upset about it. I've been around the block. It happens.But for those people, those new bloggers who are kind of upset about the internet's bad taste, might benefit from reading artist Dimespin’s essay written to other visual artists: “Why people like your doodles better than your finished works.”e.g.:Excerpt from dimespin's essay. There's more, it's a great piece, go read it.This piece is good and even if you’re not a visual artist, you can probably make your own analogies by reading it. That said, to spell out a few for the writerly crowd:The quick post is short, the effortpost is longHere is the most important thing I can tell you for writing things that people might choose to read on purpose: Make it short. Everyone has 10,000,000 other things they could be reading. Make it efficient. Make it count.If you are Scott Alexander, you can get huge readership on your long articles. If you aren’t, try either writing short things or becoming Scott Alexander. Pro tip: One of these things is easier than the other.The quick post is about something interesting, the topic of the effortpost bores most peopleThe random historical event you read half a sentence about on Wikipedia and it caught your eye? Maybe that means that it could catch a lot of people’s eyes, and your quick post has brought it to them. If you’ve spend ten years formulating a theory about your field of work, that might only be interesting to people who care about that field. Or it's about one of those \"what is good anyhow\" or \"my theory of consciousness\" type questions that people either already know about or already know they don't give a shit about. Everyone has their own theory of consciousness, Harold!The quick post has a fun controversial take, the effortpost is boringly evenhanded or laden with nuanceThe quick post is low-context, the effortpost is high-contextThe quick posts that aren’t even about a thing you’re an expert in – well, okay, you don’t know a lot, but you’ve written it as a non-expert and it’s at a non-expert’s level of understanding. Most readers aren’t experts in whatever random thing. You are automatically going on this journey of discovery with them.Meanwhile, it’s really hard to explain something you have a detailed technical understanding of, in a way that’s approachable to others. You haven’t spoken to someone who ISN’T a software engineer in eight months. You’re tripping over feldspars left and right. Even if you try to explain it to a novice, you might not do it very well. “To appreciate why this modern factory design choice is interesting, we have to understand the history of automobile manufacturing logistics. In 1886 – ” Okay, maybe you’re right, but I’m also already closing the tab.The quick post is has a casual style, the effortpost is inscrutably formalExcessive linguistic density frequently triggers a distinct reticence in opportunistic audiences to apply interpretive labor to the text in question.AKA: oh my god, just talk like a normal person, nobody wants to read all that.You might put formal language into a piece because you are an expert and you're thinking about it in jargon and conceptual terms. In this case, try saying it like you’d explain it to your buddy who doesn’t know jack shit about it.You might also use formal language in an attempt to Make It Look Professional – unless you’re aiming for a really particular audience that eats up formality, just stop doing that! Readability is kind.Look at da Vinci's works: These ladies with these muscular babies are nice or whatever, but we all know and love the dramatic four-armed man in the circle.If you're a writer and you've run into this situation and you’re upset about the internet's bad taste and lack of discernment, my main advice is that on some level, you gotta get over it. You will never have any control over what random people find interesting, or what the algorithms decide to promote, or anything at all about other people. You’re lucky to be getting an audience at all, and if you are, you're doing at least something right.If you’re smart, you can convert these flickers of fame into more readership for your other better stuff – but the attention of the internet is best modeled as a random swarm of locusts that will occasionally land on your ripe fields based on its inscrutable whims. You can go crazy analyzing it or you can just keep farming.Maybe you should just do the opposite of all these things so your writing becomes popular? Well, I don’t know. Maybe, maybe not.If you care about maximizing readership, I dunno, sure. Clickbait is popular for a reason – it works. If you don’t lie to the readers or advocate for anything evil, then I don’t think you’re doing anything wrong by optimizing for readership.Note that some topics have inherently wider appeal than others – a short light post discussing something concrete and weird about the world is definitely going to get more readers than a piece that compares different philosophical schools. But if you care about philosophy, maybe the second piece is more important to you to write. The numbers aren’t a proxy for value of the piece or quality of its ideas.Even if you’re exclusively interested in maximizing reception, audience might matter. I think very few people cared about my 2017 summary of a 2015 Blue Ribbon Study Panel on Biosecurity report, which is fair – I wrote it because I had already read this 83-page-long report, and figured someone else might just like to see my notes. And empirically they did, because a major biosecurity funder came up to me at an event and said they read it and really appreciated that I wrote it – they wanted to know what was in the original report and didn’t want to read 83 pages. This was a fantastic audience for it to reach. Or, like, if you want to contribute to the academic discourse, probably you want to engage with the academic literature, and that's just inherently gonna dissuade many casual readers.But listen, I bet you're not just writing to maximize audience. Friend of the blog Ozy Brennan once said that being a writer requires “the absolute conviction that total strangers should listen to you because your words are interesting and valuable” (as well as “the decision to choose a career where you never leave the house or talk to anyone”.)You’re here to say something interesting and valuable, right? I don’t think you ought to smooth out everything you touch for the masses. You want to say something that only you could say or that will hit the reader who needs it at the right time. You want to impress that one guy at the Blogging Club, or you practice “blogging as warnings scrawled on the cave wall”, or you’re writing for nice future AGIs creating rescue simulations of you based on your digital text corpus. Listen. Don’t lose your mind about it. Just try to say something beautiful and true. Or, failing that, say something fascinating and baffling.But, I mean, obviously it’d be nice if the masses turn out to want to hear it too. I get it. There’s nuance.This post is mirrored to Eukaryote Writes Blog, Substack, and Lesswrong.^Nobody has dropped out yet! Isn't that amazing?Discuss","pubDate":"Sun, 30 Nov 2025 20:22:54 GMT"}