{"id":"tHiB8jLocbPLagYDZ","title":"The Online Sports Gambling Experiment Has Failed","link":"https://www.lesswrong.com/posts/tHiB8jLocbPLagYDZ/the-online-sports-gambling-experiment-has-failed","published":1735948096000,"description":"Published on November 11, 2024 2:30 PM GMTRelated: Book Review: On the Edge: The Gamblers I have previously been heavily involved in sports betting. That world was very good to me. The times were good, as were the profits. It was a skill game, and a form of positive-sum entertainment, and I was happy to participate and help ensure the sophisticated customer got a high quality product. I knew it wasn’t the most socially valuable enterprise, but I certainly thought it was net positive. When sports gambling was legalized in America, I was hopeful it too could prove a net positive force, far superior to the previous obnoxious wave of daily fantasy sports.It brings me no pleasure to conclude that this was not the case. The results are in. Legalized mobile gambling on sports, let alone casino games, has proven to be a huge mistake. The societal impacts are far worse than I expected.The Short AnswerJoe Weisenthal: Why is it that sports gambling, specifically, has elicited a lot of criticism from people that would otherwise have more laissez faire sympathies?This full post is the long answer. The short answer is that it is clear from studies and from what we see with our eyes that ubiquitous sports gambling on mobile phones, and media aggressively pushing wagering, is mostly predation on people who suffer from addictive behaviors. That predation, due to the costs of customer acquisition and retention and the regulations involved, involves pushing upon them terrible products offered at terrible prices, pushed throughout the sports ecosystem and via smartphones onto highly vulnerable people. This is not a minor issue. This is so bad that you can pick up the impacts in overall economic distress data. The price, on so many levels, is too damn high.Paper One: BankruptciesWe start with discussion of one of several new working papers studying the financial consequences of legalized sports betting. The impacts include a 28% overall increase in bankruptcies (!).Brett Hollenbeck: *Working Paper Alert*: “The Financial Consequences of Legalized Sports Gambling” by Poet Larsen, @dade_us and myself. We study how the widespread legalization of sports gambling over the past five years has impacted consumer financial health. In 2018, SCOTUS ruled that states cannot be prohibited from allowing sports betting, and 38 states have since legalized sports gambling. This has led to a large new industry and a large increase in gambling accessibility. Roughly $300 billion has been bet and is growing fast.While for most gamblers it is a harmless form of recreation, we know that some fraction become problem gamblers with potentially severe financial consequences. We study these financial outcomes using a large and comprehensive dataset on consumer finances known as the UC Consumer Credit Panel (maintained by @CAPolicyLab). This allows us to track all credit and debt outcomes for roughly 7 million Americans. We leverage this data and compare states implementing sports gambling to those that don’t and study both sports gambling of any type as well as online/mobile gambling specifically. We study 8 financial/debt outcomes and find the following results: First, credit scores, a summary metric of overall creditworthiness, decrease by modest but statistically significant amounts (~1%). We also test for evidence of pre-trends between treated/control states and find none. … Second, several measures of excessive debt increase substantially. We find a roughly 28% increase in bankruptcies and an 8% increase in debt transferred to debt collectors. Similarly, auto loan delinquencies increase substantially as does use of debt consolidation loans. Interestingly, we find that banks restrict access to credit on average in affected states. Credit card limits decrease and the ratio of secured to unsecured loans increases. After three years post-legalization we actually find a decrease in credit card delinquencies as a result.I expected some negative impacts. But a 28% increase in bankruptcies is far more than I would have predicted. The typical adult bankruptcy rate is about 0.16%, so this would mean about 4bps (0.04%)/year of additional bankruptcies, or an over 1% additional chance a typical person goes bankrupt during their lifetime. Alternatively as a sanity check, that’s on the order of 100,000 additional bankruptcies a year, which will rise over time if we don’t intervene. We are talking about an average handle of maybe 120 billion in 2023, but on average lower during this time period, let’s say average of 70 billion, with a likely sportsbook hold (before expenses) of something like 10% if we exclude advantage betters who are definitely not going bankrupt, given all the parlays and shaded lines and in-game betting and generally atrocious odds, so total net losses to ‘normal gamblers’ of 7 billion per year. That suggests that for every $70k in net sportsbook gross profits from regular gamblers, someone filed for bankruptcy. That seems like a lot? It means those who are inclined to bet on sports are either often doing it out of desperation, or that the same causes that lead them to bet on sports and pushing them to the financial edge in other ways as well, and this is the straw breaking the camel’s back. Claude found it all plausible when I had it do a bunch of estimations. I do notice I am skeptical. The result is clear. A bankruptcy is extremely socially expensive, on the order of $200k. That alone is almost triple the profits, and clearly wipes out all the social gains. Legalized online sports betting is currently a deeply, deeply horrible deal. I wish it were different. I am all for letting people do things, and I have enjoyed and benefited greatly from the ability to bet on sports. And yes, I do think the majority of people who play plausibly get their money’s worth in entertainment, even at the outrageous prices charged. The problem is if a majority get a small benefit, and others get a huge loss, that is on net a disaster. I can’t look at these findings, even if I don’t fully believe them, and not see a huge disaster from these effects alone. I also can’t see a way in which the positive-sum benefits could justify that disaster.Paper Two: Reduced Household SavingsWe can then add a second paper, “Gambling Away Stability: Sports Betting’s Impact on Vulnerable Households.” They found that sports betting greatly reduced traditional net investments, while traditional gambling stays unchanged.Maxwell Tabarrok: The negative effects on investment are large relative to the sample mean. The average household invests about $360 a quarter so a $50 decrease in investment is a loss of 14%.This includes households that never bet. If this is fully real, that’s holy **** territory. It’s an apocalypse. We are decreasing net household investment by 14%? Can there possibly be compensation for that? Alex Tabarrok notes that various details seem like they prove too much, and I agree it seems unlikely the effects are this large. But it can be a lot smaller than that, and still way too high. There are a variety of goods households can choose to consume, including traditional gambling. If sports gambling were a regular consumption good that consumers were choosing because they enjoy it more, it wouldn’t be having these effects. Eating dramatically into savings rather than shifting the consumption basket, while not even reducing traditional gambling, says that consumers are clearly not responding rationally, and do not understand the choices they are making.Paper Three: Increased Domestic ViolenceHere’s a third paper, showing that sports betting increases domestic violence. When the home team suffers an upset loss while sports betting is legal, domestic violence that day goes up by 9% for the day, with lingering effects. It is estimated 10 million Americans are victims of domestic violence each year. Claude estimates if you extrapolate from this result that there might be a 3% overall increase in domestic violence as the result of legalized sports betting, which seems non-crazy given that betting on NFL home favorites is only a tiny portion of overall losses. Again, this is an overall effect for the entire population. The percentage of people who bet on sports is rising rapidly, but even so only 34% said they placed even one bet in 2023, and many of those will be limited to nominal wagers on things like the Super Bowl and March Madness. This survey has 39% sports betting participation, with about 35% of betters betting at least once a week. So again, the effects on the households that actually gamble are far higher. This is a huge direct cost to bear. Domestic violence ruins lives. It also is a huge indicator that this is causing large amounts of distress in various forms, and that those gambling on sports are not making rational or wise consumption decisions.The Product as Currently Offered is TerribleMeanwhile, frankly, the product emphasis and implementation sucks. Almost all of the legal implementations (e.g. everyone I know about except Circa) are highly predatory. That’s what can survive in this market. Why? Predation is where the money is. There is no physical overhead at an online casino, but after paying for all the promotions and credit card payments and advertisements and licenses and infrastructure, the only way to make all that back under the current laws and business models is the above-mentioned 10%-style hold that comes from toxic offerings. Thus high prices even on the main lines, even higher ones on parlays and in-game betting. Whenever I see lines on the TV I usually want to puke at how wide the prices are. In game odds are beyond obnoxious. Anyone this drives away is a customer they have decided not to want. This is what the in-game odds look like when they’re relatively reasonable, and seriously, ow my balls:(This still shows how crazy the ‘win probability’ calculation they do is, given it’s well outside the odds they themselves are offering and also makes no sense, although an inning later it went far more insane and I can’t help but share, then aside over…)All this is complemented by a strategy centered around free bet promotions (which makes the bonuses sound a lot bigger than they are), advertisements, promotional texts and emails and especially a barrage of push notifications. Anyone showing any skill? They are shown the door.Things Sharp Players DoI don’t think this is central to the case that current legal sports betting is awful, but it is illustrative what pros do in order to disguise themselves and get their wagers down. That to do that, they make themselves look like the whales. Which means addicts. I’m used to stories like this one, that’s normal:Ira Boudway (Bloomberg): If I open an account in New York, maybe for a few weeks I just bet the Yankees right before the game begins,” says Rufus Peabody, a pro bettor and co-host of the Bet the Process podcast. If this trick works, the book sees these normie, hometown bets as a sign that it’s safe to raise his limits.It seems players have upped their game.One pro bettor I know set up a bot which logs in to his accounts every day between 2 and 4 a.m., to make it seem like he can’t get through the night without checking his bets. Another withdraws money and then reverses those withdrawals so it looks like he can’t resist gambling. Simulating addictive behavior, says Peabody, is an effective way to get online sportsbooks to send you bonus money and keep your accounts open. This isn’t necessarily because operators are targeting problem bettors, he says; they’re simply looking to identify and encourage customers who are likely to spend—and lose—the most. This just happens to be a good way to find and enable addicts, too.The rest of the post is filled with the usual statistics and tragic stories. What I find interesting about these examples is that they are very level-1 plays. As in, this is exactly what someone would do if they thought they were up against a system that was looking for signs of what type of player you are, but only in the most mechanical and simple sense. For this type of thing to work, the book must not be looking at details or thinking clearly or holistically. If you had tried this stuff on me when I was watching customers, to the extent I noticed it at all, I am pretty sure I would if anything have caught you faster.People Cannot Handle Gambling on SmartphonesVices and other distractions are constant temptations. When you carry a phone around with you, that temptation is ever present. Indeed, I recently got a Pixel Watch, and the biggest benefit of it so far is that I can stay connected enough to not worry, and not be tempted to check for things, without the pull of what a phone can do. And we have repeatedly seen how distracting it is for kids in school to have the smartphone right there in their pocket. I have learned to be very, very careful with mobile games, even ones with no relevant microtransactions. Putting gambling in your pocket makes the temptation to gamble ever-present. Even for those who can resist it, that is a not so cheap mental tax to pay, and likely to result in the occasional impulse bet, even without the constant notifications. First hit’s free. Constant offers that adjust to your responses, to get you to keep coming back. Now consider that at least several percent of people have an acute gambling addiction or vulnerability. For them, this is like an alcoholic being forced to carry a flask around in their pocket 24/7, while talk of what alcohol to choose and how good it would be to use that flask right now gets constantly woven into all their entertainment, and they by default get notifications asking if now is a good time for a beer. You can have the apps back up and running within a minute, even if you delete them. It was plausible that this was an acceptable situation, that people could mostly handle that kind of temptation. We have now run the experiment, and it is clear that too many of them cannot.Yay and Also Beware Trivial Inconveniences (a future full post)I am coming around to a generalized version of this principle. There is a vast difference between:Something being legal, ubiquitous, frictionless and advertised.Something being available, mostly safe to get, but we make it annoying.Something being actively illegal, where you can risk actual legal trouble.Something being actively illegal and we really try to stop you (e.g. rape, murder).We’ve placed far too many productive and useful things in category 2 that should be in category 1. By contrast, we’ve taken too many destructive things, too many vices, that we long had the wisdom to put in category 2, and started putting them in category 1. Prohibitions, putting such things into categories 3 and especially 4, tends to work out extremely poorly. Don’t do that unless absolutely necessary. Let people do privately destructive things if they want to do that. Often, it is important that you make doing the wrong thing a little annoying. It is especially important to not make it annoying to do the productive things, and not annoying to instead do the destructive things.How Does This Relate to Elite Hypocrisy?The elite refrains from irresponsible gambling, but here sets up conditions where such irresponsible actions are the inevitable result. The actual big elite hypocrisy is not the failure to impose paternalistic rules on the non-elite, it is that we constantly imposing extreme and expensive consumption requirements and restrictions on the non-elite when they are trying to live their lives and get their needs met. We impose these deeply restrictive, expensive and stupid elite norms on others all the time. This paternalism severely damages their lives in numerous ways. This is the core reason why it is so difficult for ordinary people to pay their bills or raise families, despite earnings that would make them rich elsewhere or elsewhen. These productive actions are severely restricted, because if you are going to be productive then you have to do so ‘correctly’ and obey all sorts of rules and requirements. Whereas if your actions are destructive, well then, go ahead, and it would be wrong of us to even enforce existing law. That is a deeply toxic approach. We should reverse it. We should allow people to do productive actions as freely as possible, and put up frictions to sufficiently destructive actions. Mobile gambling has shown itself to be a highly destructive action for its users, well in excess of any profits earned, sufficiently so as to substantially damage economic conditions. A that point, we need to draw the line.The Standard Libertarian CounterargumentMaxwell Tabarrok makes the contrary case that sports gambling is ordinary consumption, and we should not assume that so-called ‘vulnerable populations’ need protections from deciding to increase their consumption. He says the evidence is not compelling here. His view is that this is no different from people buying Taylor Swift tickets. In general I am highly sympathetic to this argument. I am not looking to tell people how much to invest or what goods to consume. But here I must strongly disagree. I’ve certainly enjoyed consuming gambling, including in a few narrow small stakes cases where I wasn’t trying to be an advantage player. I think many others do so in ways that are not mistakes, or are mistakes we should allow them to make. But ‘this is normal consumption’ seems to me like an absurd interpretation of the evidence above, and fails to understand the nature of the consumption being offered. You can’t place this ability to wager directly onto everyone’s phones at all times, putting the temptation at arm’s reach, see these consequences, and pretend these consequences are merely revealed preferences.What About Other Prediction Markets?Most other prediction markets do not pose the same problems. They would not even if they greatly expanded and became more ‘normie’ friendly. In particular, sports markets are highly related to and integrated into the most ‘normie’ of activities and into the related media, and they pay off quickly, and they’re ubiquitous, with something for you every day.What Should Be DoneThe legalized mobile online sports betting experiment is a clear failure. It should end. You should need to go to a physical location to place fully legal bets of a non-trivial size, or at least interact with a human or bear some other cost or risk. I’m fine with that location being the local sports bar, especially if the bar gets to book your action. Yes, I realize that will mean more illegal and untaxed online sports betting, but it is what it is. The barriers to doing that would do a lot of good work. At a bare minimum, the advertising and dark pattern complexes feeding this must be disempowered. The Federal Government should do what it can. The states should realize they are not doing themselves any favors and resist or undo this cash grab. Legalized online casino gaming, allowing roulette or similar games from one’s phone, is of course far worse. That certainly should not be allowed via the internet. I am not keen to be expansive in what ‘counts as gambling’ but the obvious gambling that resolves in seconds and pays real money absolutely must go. We will need to figure out where to draw the line on ‘loot boxes’ and other game features, but if the more obnoxious and toxic versions of that got banned as well, that would be good too. Ben Krauss and Milan Singh reach the same conclusion at Slow Boring, although they are less willing to fully bite the bullet. Kelsey Piper, who similar to me is loathe to tell people what they cannot do, does bite the bullet. Here Saagar Enjeti bites the bullet. Here Charles Fain Lehman at The Atlantic bites the bullet. Otherwise, as the amount of gambling expands, it is only going to get worse. &nbsp; &nbsp; &nbsp;&nbsp;Discuss","pubDate":"Fri, 03 Jan 2025 23:48:16 GMT"}