{"id":"iqNjYdsectt5TvJRh","title":"Loving a world you don’t trust","link":"https://www.lesswrong.com/posts/iqNjYdsectt5TvJRh/loving-a-world-you-don-t-trust","published":1718907856000,"description":"Published on June 18, 2024 7:31 PM GMT(Cross-posted from my website. Audio version here, or search for \"Joe Carlsmith Audio\" on your podcast app.) This is the final essay in a series that I'm calling \"Otherness and control in the age of AGI.\" I'm hoping that the individual essays can be read fairly well on their own, but see&nbsp;here&nbsp;for a brief summary of the series as a whole. There's also a PDF of the whole series here. Warning: spoilers for Angels in America; and moderate spoilers for Harry Potter and the Methods of Rationality.) \"I come into the presence of still water...\" ~Wendell Berry A lot of this series has been about problems with yang—that is, with the active element in the duality of activity vs. receptivity, doing vs. not-doing, controlling vs. letting go.[1] In particular, I've been interested in the ways that \"deep atheism\" (that is, a fundamental mistrust towards Nature, and towards bare intelligence) can propel itself towards an ever-more yang-y, controlling relationship to Otherness, and to the universe as a whole. I've tried to point at various ways this sort of control-seeking can go wrong in the context of AGI, and to highlight a variety of less-controlling alternatives (e.g. \"gentleness,\" \"liberalism/niceness/boundaries,\" and \"green\") that I think have a role to play.[2] This is the final essay in the series. And because I've spent so much time on potential problems with yang, and with deep atheism, I want to close with an effort to make sure I've given both of them their due, and been clear about my overall take. To this end, the first part of the essay praises certain types of yang directly, in an effort to avoid over-correction towards yin. The second part praises something quite nearby to deep atheism that I care about a lot—something I call \"humanism.\" And the third part tries to clarify the depth of atheism I ultimately endorse. In particular, I distinguish between trust in the Real, and various other attitudes towards it—attitudes like love, reverence, loyalty, and forgiveness. And I talk about ways these latter attitudes can still look the world's horrors in the eye. In praise of yang Let's start with some words in praise of yang. In praise of black Recall \"black,\" from my essay on green. Black, on my construal of the colors, is the color for power, effectiveness, instrumental rationality—and hence, perhaps, the color most paradigmatically associated with yang. And insofar as I was especially interested in green qua yin, black was green's most salient antagonist. So I want to be clear: I think black is great.[3] Or at least, some aspects of it. Not black qua ego. Not black that wants power and domination for its sake.[4] Rather: black as the color of not fucking around. Of cutting through the bullshit; rejecting what Lewis calls \"soft soap\"; refusing to pretend things are prettier, or easier, or more comfortable; holding fast to the core thing. I wrote, in my essay on sincerity, about the idea of \"seriousness.\" Black, I think, is the most paradigmatically serious color. And it's the color of what Yudkowsky calls \"the void\"—that nameless, final virtue of rationality; the one that carries your movement past your map, past the performance of effort, and into contact with the true goal.[5] Yudkowsky cites Miyamoto Musashi: The primary thing when you take a sword in your hands is your intention to cut the enemy, whatever the means... If you think only of hitting, springing, striking or touching the enemy, you will not be able actually to cut him. More than anything, you must be thinking of carrying your movement through to cutting him. Musashi (image source here) In this sense, I think, black is the color of actually caring. That is: one becomes serious, centrally, when there are stakes; when one has what Yudkowsky calls \"something to protect.\" And the void is the virtue that won't forget, or half-ass, or look away; that fuels its life with its real fire, and so channels living energy and heat. Indeed, professions of care that seem lacking in black can easily seem like they are missing a mood. Thus, for example, the core push of effective altruism. \"Wait, you said that you cared about helping others. So where is the black?\" And because black actually cares, it has standards. Green often wants to blur distinctions; to resist binaries and oppositions; to soften and unify and include. But black refuses to unsee the difference between success and failure, excellence and incompetence, truth and falsehood. In this, it aspires to a kind of discipline; some archetypally military virtue; the sort of vibe that emerges when, if you're wrong, then your friends all die. At various points in this series, I've worried about losing touch with this vibe. It's easy, when writing about green, and Otherness, and tolerance, and \"not seeking control,\" to say soft and blurry and pretty things; kumbaya things. It's easy to play for a certain kind of sage nod; easy to channel parts of the zeitgeist suspicious of archetypically masculine vices in particular, and to get lazy and rose-colored about the full picture. I hoped that the image of a grizzly bear eating Timothy Treadwell alive could help, here. I wanted to remember, up front, about teeth, and blood, and the costs of the wrong yin. And having written so much about yin, green, etc, I find myself wanting to praise other black-like virtues as well: virtues like strength, health, energy, abundance.[6] I find myself wanting to talk about the enormous benefits of growth and technology; about the ways wealth and power need not be zero-sum; about how much good yang the future could have. You've heard this stuff before. I won't dwell. And green can like these things too. But we should remember how much of what we like here is black. Bad things are bad But beyond black qua seriousness, void, discipline, strength, there's something else yang-like I want to honor, here too—something that I associate, more directly, with deep atheism in particular. Earlier in the series, I quoted Yudkowsky's essay about his brother Yehuda's death. ... Yehuda did not \"pass on\". Yehuda is not \"resting in peace\". Yehuda is not coming back. Yehuda doesn't exist any more. Yehuda was absolutely annihilated at the age of nineteen. Yes, that makes me angry. I can't put into words how angry. It would be rage to rend the gates of Heaven and burn down God on Its throne, if any God existed. But there is no God, so my anger burns to tear apart the way-things-are, remake the pattern of a world that permits this.\" I think the essay about Yehuda may be the best thing Yudkowsky's ever written. If the void is the virtue that channels \"real fire,\" we see that fire burning here. And insofar as the void, in Yudkowsky's portrayal, tries always to \"cut the enemy,\" we see that enemy, too. Or at least, one enemy. \"One point eight lives per second, fifty-five million lives per year.... Yehuda's death is the first time I ever lost someone close enough for it to hurt. So now I've seen the face of the enemy. Now I understand, a little better, the price of half a second.\" Green is often shy about that word, \"enemy.\" It is suspicious of anger; suspicious of the impulse to kill, to end, to banish. The green-like point, often, is not to defeat darkness, but rather: to know it; to find yourself in its gaze; to bring darkness and light together; and so to become more whole.[7] Indeed, green often emphasizes the importance of honoring and making space for the archetypally \"bad\" side of some duality. Death, decay, suffering, loss—for everything there is a season.[8] And no wonder: unlike deep atheism, green often tries to find some trust or holiness or sacredness in Nature—and Nature is full of such darkness. But deep atheism has no such allegiance to Nature. And so it is free to recognize that bad things can be just bad: they do not also need to be somehow good, or sacred, or profound. This isn't to say that you shouldn't try to understand them—to see how and why they might be tied up with your own heart, and what it loves. And badness rarely comes pure; rarely \"just\" bad. But even if something is merely bad overall: still, sometimes, once you have looked something dark in the eye, and learned its True Name, then the right choice is, in fact, to fight it; to defeat it; and sometimes, if you don't have better options, to kill it.[9] Cancer cells and invading Nazi soldiers are canonical examples here; and see also this description of smallpox (again using \"enemy\" rhetoric).[10] Indeed: we rarely have the luxury of understanding some darkness fully before we need to decide whether to fight, or kill. But doing so can be the right choice anyway. 16th century Aztec drawing of smallpox victims (Image source here) Maybe this sounds obvious? \"Bad things are bad.\" But sometimes it breaks into my mind with fresh intensity. I've written, previously, about the way sometimes, on the comparatively rare occasions when I experience even-somewhat-intense suffering or sickness, it comes as a kind of de-fogging. The pain that surrounds me all the time comes rushing back to memory, sharp and sudden—the pain of the people I pass on the street; the pain of the friends who've killed themselves; the pain of hospitals and factory farms, aging and war, dementia and depression and despair. Had I forgotten? But it still seems newly clear, and so central to the story; so core to what's really going on. At some point, writing this series, I had a mild moment of this flavor. I forget what triggered it. But I lost my taste, in that moment, for something I had been writing about yin. I had touched some darkness that reminded me what an indifferent universe means, and I wanted no romance, or cleverness, or evasion. We are more than enough weak and vulnerable. We don't need more. Rather, we need what we're always wanting: more warmth, more light, more strength. And I had another, related moment visiting Washington D.C., at the World War II memorial. There's a wall fixed with four thousand golden stars, each representing a hundred American soldiers who died in the war. The inscription reads: \"Here we mark the price of freedom.\" World War II memorial It's not a yin thing. And I don't want to forget. Killing dementors One other note in direct praise of yang. There's a scene in Yudkowsky's Harry Potter fanfiction where Harry destroys a dementor. In a sense, I think, it's an extension of the Yehuda essay. And in my opinion, it's the best scene in the book. Dementor (image source here) The dementors, Harry has been told, can't be destroyed. The only protection from them is to conjure a ghostly animal—a \"patronus\"—fueled by thinking happy thoughts. But Harry, initially, can't do the charm. Faced with a dementor, some cold and unspeakable horror crashes through his mind, feeding on him; and the light and goodness inside him almost dies. But with a friend's help, he survives. And nursed by Dumbledore's phoenix, he looks again, directly, at the horror beneath the tattered cloak—\"the void, the emptiness, the hole in the universe, the absence of color and space, the open drain through which warmth poured out of the world.\" And he sees what he did wrong. Somehow, Harry realizes, the dementors are death—or at least, the shadow of death, cast by magic into the world. \"I know you now,\" he thinks. Harry thought of the stars, the image that had almost held off the Dementor even without a Patronus. Only this time, Harry added the missing ingredient, he'd never truly seen it but he'd seen the pictures and the video. The Earth, blazing blue and white with reflected sunlight as it hung in space, amid the black void and the brilliant points of light... Would they still be plagued by Dementors, the children's children's children, the distant descendants of humankind as they strode from star to star? No. Of course not. The Dementors were only little nuisances, paling into nothingness in the light of that promise; not unkillable, not invincible, not even close. You had to put up with little nuisances, if you were one of the lucky and unlucky few to be born on Earth; on Ancient Earth, as it would be remembered someday. That too was part of what it meant to be alive, if you were one of the tiny handful of sentient beings born into the beginning of all things, before intelligent life had come fully into its power. That the much vaster future depended on what you did here, now, in the earliest days of dawn, when there was still so much darkness to be fought, and temporary nuisances like Dementors. And with this image and others in mind, Harry prepares to think a new kind of happy thought. The patronus charm normally works via the caster blocking out the dementor and thinking about something else; patronuses are animals because their ignorance shelters them from fear. But Harry has trained himself not to take shelter in ignorance, or to look away from darkness. So he looks straight at it instead. He thinks of his utter defiance towards death; of humanity's capacity to end it; and of the way future humans will weep to learn that it ever existed. The wand rose up and leveled straight at the Dementor. \"EXPECTO PATRONUM!\" The thought exploded from him like a breaking dam, surged down his arm into his wand, burst from it as blazing white light. Light that became corporeal, took on shape and substance. A figure with two arms, two legs, and a head, standing upright; the animal&nbsp;Homo sapiens,&nbsp;the shape of a human being. Glowing brighter and brighter as Harry poured all his strength into his spell... You are not invincible, and someday the human species will end you. I will end you if I can, by the power of mind and magic and science. I won't cower in fear of Death, not while I have a chance of winning. I won't let Death touch me, I won't let Death touch the ones I love. And even if you do end me before I end you, Another will take my place, and another, Until the wound in the world is healed at last... Harry lowered his wand, and the bright figure of a human faded away... The tattered cloak lay empty within the cage. The essay about Yehuda named death as enemy. This scene enacts part of the fight, and of the enemy's defeat. And it draws on many of the yang-like energies I want to honor: on the void; on defiance and courage; on being willing to look directly at darkness. It channels the thing in the book represented by Godric Gryffindor, and by the cry of the phoenix. Not just black; more like a fusion of red-white-black. Or in the book: red and gold. To be clear: I'm not endorsing all of Harry's vibe here.[11] Nor am I trying to argue about the merits or mortality of death. But having written this series, and especially the bits about the role of yin, I felt some need to point at this scene with the dementor and say \"this; this too.\" Humanism Vitruvian Man, by Da Vinci (Image source here) Ok, those were some words in praise of yang—offered, in part, in an effort to avoid over-correction towards yin. In this section, I want to take a moment to do something similar with deep atheism. In particular: having written so much about ways deep atheism can lead to scary places, I don't want to lose touch with something closely related to deep atheism that I care about a lot. I'll call this thing \"humanism.\" It's an ethic often claimed by atheists, including deep atheists.[12] And while I'll use the term in my own way, I do mean to point at something similar—except, the version I like most.[13] Indeed, as I'll discuss in section 3, the humanism I like can be understood as a specific form of deep atheism—except, with a particular sort of existential orientation. This section tries to evoke that orientation directly; in section 3, I talk more explicitly about its contrasts with other forms deep atheism can take. \"Humanism\" isn't quite the right word. In particular: it suggests more of a focus on literal humans than I have in mind—something too close to species-ism.[14] Maybe what I really mean is \"the project of the Enlightenment.\" Both terms come with their own baggage; I'll stick with \"humanism\" for now. But to be clear: humanists can care a lot about non-humans; and non-humans—even \"misaligned\" ones—could be humanists in the sense I mean. Stars and campfires To get an initial flavor of the sort of \"humanism\" I have in mind, consider the image, in the dementor scene, of the earth suspended in the dark, amidst the stars. In my essay on deep atheism, I mentioned the rationalist \"secular solstice\" event. \"Humanist culture,\" it says on the website. I've been a few times, and it has indeed informed my conception of humanism. And a big theme of the secular solstice is darkness—\"a universe that is often cold and uncaring.\" The image is of winter; of huddling around a campfire; of a night dark and full of terrors. The solstice celebrates the steps humanity has taken out of this night, into light and science and strength. And it looks, like Harry, to the stars. Do you like the stars? Many humanists do, myself included. Indeed, Harry experiences them with quasi-religious reverence. And see also, classically, Carl Sagan—a central instance of humanism, for me. Here I think, in particular, of classics like \"Pale Blue Dot,\" and (even better, imo) \"The Frontier is Everywhere.\"[15] But also: this scene from the film version of Sagan's novel \"Contact,\" in which the protagonist, sent through space, glimpses some \"celestial event\" beyond her ship. \"No words,\" she gasps. \"They should've sent a poet.\"[16] (Video) But I know people who don't like the stars. The universe, for them, is too big and bleak and cold. And for all the popularity of space stuff amongst deep atheist types, the more negative take on space seems to me the more natural to the worldview. Earth itself is the real campfire, and space the true winter; the longest night; where God's indifference reigns most raw and alien. I thought the movie \"Interstellar\" did this well; the desolation of the most habitable planets they could find; endless water; endless ice.[17] This year there was a total eclipse—and for some people, total eclipses disclose this desolation, too. Light can just leave. It gets cold without the sun. Even Annie Dillard, often ecstatic about Nature, found herself unmoored and un-meaning-ed by the black moon: There was no world. We were the world's dead people rotating and orbiting around and around, embedded in the planet's crust, while the earth rolled down... It had nothing to do with anything. The sun was too small, and too cold, and too far away, to keep the world alive. The white ring was not enough. It was feeble and worthless... We had all died in our boots on the hilltops of Yakima, and were alone in eternity. Empty space stoppered our eyes and mouths; we cared for nothing. Image source here Is it Lovecraft's most famous line? \"We live on a placid island of ignorance in the midst of black seas of infinity...\" I'll talk about some of my disagreements with Lovecraft below. But I agree that we live on some island, amidst some black sea. And I think of humanism as, partly, about standing together on this island; nurturing our campfire; learning to see into the dark, and to voyage further. And again, writing about green, I've worried that something about this black sea would get lost, or downplayed. It's not just that earth's forest is brutal and bloody; it's that the forest is campfire compared to that dark void, the true wild. Maybe green trusts in the Universe; but the Universe itself is notably un-green, color-wise.[18] So too \"Nature.\" Green is not God's color—not now. Rather, it's a thin film coating a mote of dust. Adulthood So one key image for me, re: humanism, is this uncaring dark; and of working together to protect some flame. I also associate humanism with something like adulthood. Standing on your own feet; looking out of your own eyes; stepping into the real world, and taking responsibility for what you are doing and why.[19] I mentioned the Enlightenment above. The archetypal intellectual vibe I associate with the Enlightenment involves some sense of waking up, growing up, getting a grip. And also, of excitement; of a world newly fresh and open and to-be-lived-in.[20] \"Emergence,\" as Kant put it, from \"self-imposed immaturity.\" In this sense, I associate humanism with some notion of \"dignity\"—some sense of a straighter back, and a steadier gaze. I also associate it with a sense of various mediating stories and abstractions falling away; of being left, more, with the raw thing. And I think of it as related to being \"alone\"; of having, Godric Gryffindor puts it, \"only nothingness above.\" This last bit sounds a lot like atheism; but actually, I'm not sure.[21] At the least, various enlightenment thinkers were theists of a kind. And atheists often speak about how, even if there were a creator God (is there?), he would come with no intrinsic authority; we would still need to judge him for ourselves. Indeed, various humanist fictions feature a God who ends up warranting defiance—see, e.g. His Dark Materials (Pullman: \"My books are about killing God\"); and also Angels in America, discussed below.[22] Some sort of theism is true in those books; but I would still call their heroes humanists. In this sense, humanism in my sense is more about how you \"look back\" at Reality, rather than about what you see. \"Astronomer Copernicus; or Conversations with God\" by Jan Metajko (image source here) Angels in America As a final pointer at humanism, I want to talk a bit about Tony Kushner's play Angels in America—one of my favorite plays,[23] and another paradigm of humanism for me.[24] Prior Walter is a gay man living in New York City in the 80s. He has AIDS, at a time when AIDS was a death sentence. We see his lesions. We see his friends dying around him. We see him choking down pills by the fistful; collapsing in his hallway; shitting blood. But also: Prior is having visions. An angel visits him. God, she tells him, has abandoned heaven. The fabric of the world is starting to unravel, and the apocalypse is coming. The angel declares Prior a prophet of statis—an end to humanity's movement, migration, exploration—and of death. But Prior rejects the angel's mission. When she first arrives, he tries to kick her out of his apartment. Later, he wrestles her to the ground, and demands that she take back her prophetic mission, and bless him. Eventually, he ascends to heaven, where he meets the rest of the angels, who try to convince him that death would be a mercy. (Video) ANGEL: We are failing, failing. The Earth and the Angels ... Who demands: More Life, when Death like a protector blinds our eyes, shielding from tender nerve more horror than can be borne? Let any Being on whom Fortune smiles creep away to Death before that last dreadful daybreak, when all your ravaging returns to you... But Prior refuses. PRIOR: But still. Still. Bless me anyway. I want more life. I can't help myself. I do. I've lived through such terrible times, and there are people who live through much much worse, but ... You see them living anyway. When they're more spirit than body, more sores than skin, when they're burned and in agony, when flies lay eggs in the corners of the eyes of their children, they live... We live past hope. If I can find hope anywhere, that's it, that's the best I can do. It's so much not enough, so inadequate but . . . Bless me anyway. I want more life. Jacob wrestling with the angel (Image source here) I think some kind of humanist vibe shines through hard in this scene—and elsewhere in the play as well. I mentioned \"defiance\" above—including towards God himself. When he first gets to heaven, Prior tells the Angels: \"God—He isn't coming back. And even if He did ... if He ever did come back, if He ever dared to show His face ... If after all this destruction, if after all the terrible days of this terrible century He returned to see ... You should sue the bastard.\" And as ever, the problem with God is evil—pain, disease, loss. There's a scene with a Mormon woman named Harper, who has learned that her husband, Joe, is gay, and that he doesn't love her. At a Mormon visitor's center, the wife in a diorama of a Mormon family crossing the prairie comes to life. Harper speaks to her. (Video) HARPER: In your experience of the world. How do people change? MORMON MOTHER: Well it has something to do with God so it's not very nice. God splits the skin with a jagged thumbnail from throat to belly and then plunges a huge filthy hand in, he grabs hold of your bloody tubes and they slip to evade his grasp but he squeezes hard, he insists, he pulls and pulls till all your innards are yanked out and the pain! We can't even talk about that. And then he stuffs them back, dirty, tangled and torn. It's up to you to do the stitching. But amidst all this pain, and all this anger at God, the play wants to stand upright, and to find its way. At one point, Harper meets Prior in heaven. She, too, could abandon earth; but she goes back—devastated by her loss; but fueled, too. \"I feel like shit but I've never felt more alive... I don't think God loves His people any better than Joe loved me. The string was cut, and off they went. Ravaged, heartbroken, and free.\" And the play believes in what Harper calls \"a kind of painful progress.\" The last scene takes place at a fountain in Central Park. It's an image, we learn, of the biblical fountain of Bethesda—said to flow again at the end of days.[25] \"If anyone who was suffering, in the body or the spirit, walked through the waters of the fountain of Bethesda, they would be healed, washed clean of pain.\" Bethesda Fountain The play ends with Prior addressing the audience directly: (Video) PRIOR: This disease will be the end of many of us, but not nearly all, and the dead will be commemorated and will struggle on with the living, and we are not going away. We won't die secret deaths anymore. The world only spins forward. We will be citizens. The time has come. Bye now. You are fabulous creatures, each and every one. And I bless you: More Life. The Great Work Begins. What is this great work? I don't think it's just beginning. I think it began a long time ago, and we live in its midst. It's the work of campfire, garden, healing water. To unbend our backs. To make gentle the life of this world.[26] It's real work. We've done it, some. We can do it more.[27] And the future could be, indeed, as fountain. What depth of atheism? OK, I've now offered some words in praise both of yang, and of humanism. In each case, I've done so in an effort to make sure that I don't let core stuff I care about get lost in the series' talk of yin, green, and the rest. In both cases, though, I've been channeling something at least nearby to deep atheism fairly hard—despite having pushed back on deep atheism, in various ways, throughout the series. So I want to close with an effort to be clear about the depth of atheism I ultimately endorse. Deep atheism, as I defined it, was about a fundamental mistrust towards Nature, and towards bare intelligence. Some of that mistrust, I argued, comes from the structure of epistemology itself. Scout mindset accepts that Reality, the ultimate Uncontrolled, could be as arbitrarily horrible as is compatible with your evidence. In that sense, it renounces a priori trust—the sort of trust that knows, before looking, that it lives in the arms of a good God, and can rest. Deep atheism admits no such comforts. This bit seems clearly right to me. But deep atheism, in my discussion, went further. In particular: it drew more specific empirical lessons about which things are what degree trustworthy; it came in with pessimistic priors about whether to expect the Real to be Good; and it endorsed anti-realism about meta-ethics, which made Intelligence orthogonal to Goodness in the same way Nature is—since Intelligence is just Nature, organized and amplified. My takes on these bits of deep atheism are somewhat more complicated. I agree, obviously, with the empirical basics with respect to death, suffering, the brutality of Nature, and so on. And I do think these are enough to break certain kinds of trust-in-the-Universe. But exactly what types, in which contexts, is a subtler and more detailed question—one I think best approached case-by-case, with \"priors\" swiftly becoming vastly less relevant. And while meta-ethical anti-realism is by far my best-guess view, I'm less confident in it than some deep atheists I know, and I care about making sure that in worlds where some sort of moral realism is true, we end up in a position to notice this and respond appropriately.[28] Still, overall, and modulo the messiness of actual empirical forecasting, I'm quite sympathetic to deep atheism's basic take on the trustworthiness of Nature, and of bare intelligence—where by trustworthiness I mean something like \"can be counted on to end up good\"; \"can be safely taken as an object of yin.\" When I've written, in this series, about \"gentleness\" and \"liberalism/niceness/boundaries\" and even about \"green,\" I've meant to be pointing, mostly, at vibes and values that I think are compatible with sophisticated (albeit, less paradigmatic) forms of deep atheism, even if more simplistic forms tend to carry momentum in the opposite direction. But even once you have fixed your degree of trust in something, and made your forecasts about how it will behave, this still leaves many other aspects of your overall attitude towards it unresolved. Maybe you do not trust that bear enough to leave your bear mace behind; but does that mean you see its eyes as dead? Maybe you don't trust your five-year-old son to handle your finances; but don't you love him all the same? Maybe you'd die trying to climb that mountain; but is it not beautiful? So really, deep atheism qua \"claim about the universe's trustworthiness\" can splinter into a variety of different, more holistic existential orientations. And about these, I'm more opinionated. In particular, I notice that I have use for words like \"sacred\" and \"holy\"; for \"spirituality\"; and for vibes nearby to \"green,\" in ways that I think deep atheists often don't. The essay about \"attunement,\" especially, was trying to point at this bit. Insofar as a given form of deep atheism is on board with that essay—well, then, OK. But insofar as it isn't, or if its paradigmatic vibe isn't, I want to notice the difference. The Lovecraft-Sagan spectrum Can we say more about what this sort of difference consists in? I wrote, in the deep atheism essay, about spirituality as expressing what I called \"existential positive.\"[29] Even without a Big-Man-God, it still turns towards the Real, the Ultimate, with some kind of reverence and affirmation. I think my relationship to the Real has some flavor like this. I don't trust the Real to be good. But for all its indifference, it also doesn't land, for me, as neutral, or blank. Rather, the Real has some kind of shine and charge. It calls, wild and silent and too loud to be heard, from some ultimate depth. And the experiences I care about most present themselves as movements in its direction. Hence, indeed, my opposition to experience machines.[30] To get more of a flavor of what I mean by \"existential positive,\" consider the contrast with H.P. Lovecraft, mentioned above. (Image source here.) Lovecraft, in my view, is existential negative. Here, for example, is the full version of the black sea quote: \"The most merciful thing in the world, I think, is the inability of the human mind to correlate all its contents. We live on a placid island of ignorance in the midst of black seas of infinity, and it was not meant that we should voyage far. The sciences, each straining in its own direction, have hitherto harmed us little; but some day the piecing together of dissociated knowledge will open up such terrifying vistas of reality, and of our frightful position therein, that we shall either go mad from the revelation or flee from the light into the peace and safety of a new dark age.\" Fun stuff. And it's not quite not spirituality. At the least, it's not neutral on the Real. Rather, the Real fills Lovecraft with a kind of horror. No wonder, then, that he endorses a kind of experience-machining. The night is too dark, and full of terrors; we should swaddle ourselves in some cocoon, and try to forget. The AI safety scene sometimes draws on Lovecraft's theology (see e.g. shoggoths; or Alexander on Cthulhu). And it's a vibe worth grokking. But I've never gotten into Lovecraft's actual writing, despite multiple attempts.[31] It's not just unpleasant and baroque. Rather, it's like he's looking at a different and less beautiful world. He's too far on the \"terror\" aspect of sublimity. Everything makes him shudder; everything beckons towards insanity. He'll stand as wanderer over the sea of fog; but instead of splendor he'll see hideous madness. \"The horror, the unspeakable madness ...\" (Image source here) Of course, Lovecraft's is only one form of existential negative. There are many ways to find the Real repugnant; to end up alienated, fundamentally, from the world. Still, I think of him as an interesting paradigm. Indeed, I sometimes think of a kind of hazy spectrum between Lovecraft's atheism, and Carl Sagan's. Both sides stand in the enveloping cosmic dark. But the Lovecraft side stands in horror, and the Sagan side, in wonder.[32] And what about the middle? The middle, as I think of it, stands in a kind of blank. It has no relationship to the Real per se. The Real is neutral. Maybe even: boring. This is the part of the spectrum I associate, mostly directly, with \"secularism,\" and with related forms of \"disenchantment.\" And it's the type I associate with a more watery and domesticated humanism that I don't like so much—a type that says something like: \"Enough with this cosmic stuff—it's gone dead. But let's enjoy a nice afternoon, and our tea, before it gets cold.\" Here I think of a talk I heard at an atheist club in undergrad, in which the speaker suggested that in the place of the orienting meaning that religion provides, maybe atheism could promote an activity like ultimate frisbee, which is fun and creates community. Can you see the difference from Sagan and Kushner and Yudkowsky—and indeed, from Lovecraft? I like tea and frisbee fine. But some kind of existential intensity is getting lost, here. There is some un-relating to the whole story; some blinkering of the attention. Of course, not all \"neutrality\" towards the Real need take so tepid a form. And a subtler spectrum, more broadly, would admit many more dimensions, to better capture the many varieties of atheistic passion and indifference.[33] Still, insofar as this simplified spectrum hazily represents different ways of doing deep atheism, I end up on the \"positive\" end; the Sagan side. And interestingly, I think that various of the deep atheists I've mentioned in the series do, too—at least sometimes. Re: Yudkowsky, for example, I already mentioned Harry's intensely spiritual relationship to the stars; and when Yudkowsky talks about value, he often talks about \"minds that can look out at the universe in wonder.\"[34] And Herzog, too, for all his pessimism about the brutality of Nature, still holds its beauty in reverence.[35] See, for example, Encounters at the End of the World, in which Herzog travels to Antarctica, partly for the wild desolation, and partly to meet the scientists and workers drawn to the edge of the map. It's an intensely humanistic film, in my view, despite various pessimisms; and it treats the landscape, and the voyaging humans, with a kind of holiness. See, for example, this scene of divers descending under the ice, into what they often call the \"cathedral,\" and the piercing music Herzog places in the background. \"To me,\" says Herzog, \"they were like priests preparing for mass.\"[36] (Video) Mother love and loyalty But if we are doing \"existential positive\" in some non-theistic sense—what sense, exactly? And in particular, what does this sense say about \"bad things are bad\"? If you have reverence towards the Real, does that mean you have reverence towards cancer, rape, dementia, genocide? Aren't you really only \"positive\" towards particular bits of the Real, rather than the Real itself? I wrote an essay about this a while back. I do think that the first pass answer is that we are most paradigmatically \"positive,\" even in \"spiritual\" contexts, towards specific bits of the Real. For all that Ginsberg proclaims everything holy—cock and ass, shit and sand and saxophone—in practice, we direct our reverence via specific centers of meaning and beauty: stars, music, ancient abbeys, light in the trees; and not greasy forks, hemorrhoids, parasites, plaques in your nerve tissue. And even to the extent we are directing our reverence via centers of beauty/meaning towards some larger whole, this reverence can't, unconditionally, indicate something like \"net good,\" \"better-than-nothing,\" \"I want more of this\"—because the larger whole could be not-that-way. Indeed, per scout mindset, we could yet discover that the world is as arbitrarily horrible as is compatible with our evidence—and would we still be \"existential positive\" then? Are any universes not glorious? Bruegel imagines the mouth of hell (Image source here) We can talk, if we want, about spiritualities that find some glory, at least, even in the most un-glorious hell. Or more exotically, about spiritualities that deny that hell is truly possible—the way, perhaps, that mathematics had to be this beautiful. But I think it's fairly clear that many core aspects of spirituality—especially non-theistic spirituality—have some more restricted and conditional component. They don't, really, revere bare Being (hell has that); rather, they revere Being in some particular form.[37] But importantly, I think they also tend to revere Being in a particular way, or a cluster of ways. And I think these ways are often subtler and more interesting than simply calling some stuff good, and some stuff bad. The Lovecraft-Sagan spectrum isn't just \"axiology\" in disguise—and I want to hold on to the difference. For example: in the essay on evil, I talked about what Fromm (1956) calls \"father love\" and \"mother love.\" (To be clear: these are archetypes that actual mothers, fathers, non-gendered parents, non-parents, etc can express to different degrees. Indeed, if we wanted to do more to avoid the gendered connotations, we could just rename them, maybe to something like \"assessment love\" and \"acceptance love.\") Fromm's archetypal father assesses the child's merits, and apportions love accordingly—the child has either met a certain standard, or not.[38] But Fromm's archetypal mother does something more complicated. She comes from some more nurturing and loyal place—some place more resilient to the child's faults; a place that does not push the child away, when she sees imperfection, but rather, stays engaged.[39] And notably, in the context of deep atheism, this doesn't mean that mother love is any less conscious of the child's faults; or that it makes worse predictions. Fromm's mother and father can trust the child to the same degree—for example, with the finances. But the mother has some other sort of yin towards the child that the father does not. Some kind of softness, and ongoing attention. Some still-there-for-you. Some not-giving-up. Chesterton gestures at something similar when he talks about \"loyalty.\" My acceptance of the universe is not optimism, it is more like patriotism. It is a matter of primary loyalty. The world is not a lodging-house at Brighton, which we are to leave behind because it is miserable. It is the fortress of our family, with the flag flying on the turret, and the more miserable it is the less we should leave it. The point is not that this world is too sad to love or too glad not to love; the point is that when you do love a thing, its gladness is a reason for loving it, and its sadness a reason for loving it more... What we need is not the cold acceptance of the world as a compromise, but some way in which we can heartily hate and heartily love it. We do not want joy and anger to neutralize each other and produce a surly contentment; we want a fiercer delight and a fiercer discontent.[40] I think that Prior, in Angels in America, has something like this loyalty. As he leaves heaven, his disease—absent in heaven—returns to him: leg pain, constricted lungs, cloudy vision.[41] He gathers his strength, and tells the angels, calmly: \"I'm leaving Heaven to you now. I'll take my illness with me, and. And I'll take my death with me, too. The earth's my home, and I want to go home.\" Prior hates, fiercely, the world's pain. But he loves his home fiercely, too. And he won't give up. Should we ever give up? What about: on hell? Well, at the least, we should destroy hell.[42] And while you can love hell's occupants, and love what it could've been, you can't, really, love what it is—not without betraying your true heart. So some kind of father love has its place, too.[43] Most loyalties need limits; and talk of \"unconditional love\" can get sloppy fast. But I think the distinctive way that mother love and Chestertonian loyalty relate to the world's faults is worth noticing all the same. Innocence and forgiveness And beyond mother love and Chestertonian loyalty, I think \"existential positive\" can take on other, richly-textured structures as well. In particular, I'm interested in things like \"grace,\" \"tragedy,\" \"innocence, and \"forgiveness\"—all structured, specifically, in relation to the world's faults; but all expressing a type of love and yin; something other than alienation, or turning-away. Jesus, famously, had a thing about some stuff in this vicinity. And I've always found this one of the most compelling parts of Christianity—the way the cross reaches to the bottom of the world's pain and sin, and holds it all. See, also, the prodigal son. And \"love your enemies\" is related, too. \"The Crucifixion,\" by Tinoretto (image source here) But what sort of love? Here's one variant—though not, I think, the one most directly at stake in Christianity. I wrote, a while ago, about a way in which it's possible to see, underneath the world's evil, a certain kind of innocence. That essay was interested in evolution in particular: the way Nature's brutality emerges, ultimately, from blind, mute, and unselfish patterns—genes—that snag against the swirl of physics, and get carried forward, building pain and violence around them, with no knowledge of what they do. But the point generalizes—at least, conditional on atheism. That is, absent a mind-like creator, the whole thing blooms, ultimately, out of something silent and beyond-moral. Trace the arc of your anger deep enough, and the bottom falls out. Your mind passes through \"enemy\" to body, neurons, genes, atoms, and on into some more naked and primordial source, where the fingers of blame falter and un-grip.[44] It's related to the thing Yudkowsky is talking about, when he says: \"I do not believe the universe to be evil, a reply which in these days is called atheism.\" And while \"not evil\" can seem like cold comfort relative to \"good,\" I find it makes a difference for me. \"Nature's silence is its one remark,\" writes Annie Dillard. When I can hear that silence beneath the noise, some part of me un-clenches, and I find it easier to love the world, for all its pain.[45] Of course, even if the ultimate ground of things is innocent, the things themselves might not be. Maybe Nature knows nothing of the pain it creates. But humans, Nature's creatures: they know. And sometimes, they make pain anyway. So any talk of \"innocence\" needs to not lose sight of guilt. Indeed, Jesus came not to declare innocent, but rather to forgive. But even in response to intentional evil, I think that some mix of \"innocence,\" \"forgiveness,\" and \"tragedy\" can swirl together, against the backdrop of Nature's silence, in a way that makes love easier. One of my favorite parts of Angels in America is about something like this. Roy Cohn, one of the play's villains, is dying in the hospital of AIDS. And he is being haunted by the ghost of Ethel Rosenberg, who he helped send to the electric chair. She tells him: I decided to come here so I could see could I forgive you. You who I have hated so terribly I have borne my hatred for you up into the heavens and made a needle-sharp little star in the sky out of it... I came to forgive but all I can do is take pleasure in your misery... Eventually, Roy dies—wholly unrepentant.[46] Belize, Roy's night nurse, wants someone to say Kaddish, the Jewish prayer for the dead. But Belize isn't Jewish, so he tries to recruit Louis, who self-describes as an \"intensely secular Jew,\" to help. But Louis, too, hates Roy Cohn: LOUIS: Fuck no! For him?! No fucking way! ... I can't believe you'd actually pray for— BELIZE: Louis, I'd even pray for you. He was a terrible person. He died a hard death. So maybe . . . A queen can forgive her vanquished foe. It isn't easy, it doesn't count if it's easy, it's the hardest thing. Forgiveness. Which is maybe where love and justice finally meet. Peace, at least. Isn't that what the Kaddish asks for? Louis tries to start the Kaddish, but he can't remember it. Then, from the darkness, the ghost of Ethel Rosenberg emerges, speaking the words of the prayer. And they pray together over Roy's body. (Video) I love this scene, and the performance above.[47] There is some building pain and anger in their voices, as they pray. They never lose sight of Roy's faults. Indeed, they both end the prayer with \"you son of a bitch.\" But the pain in their voices pierces past Roy, to encompass some larger tragedy—the world that created Roy; the world of AIDS and electric chairs and mothers singing to their dying sons. And it holds that world, Roy included, in some fierce and sacralizing gaze. We also see a kind of forgiveness—albeit, of a different flavor—in HPMOR.[48] Harry has a chance to hurt a man who has killed and tortured victims untold (and who, like Roy, is unrepentant). There would be, Harry thinks, a kind of justice. But Harry thinks of the stars, and of what future generations—the \"children's children's children\"—would want him to do. And he concludes that to hurt this man any more than needed would be \"a not-necessary tragedy happening to one more sentient being ... just be one more element of the sorrows of ancient Earth so long ago.\" So he lets any sense that he is obligated to be angry \"drain away beneath the starlight\"; and he casts a spell infused with grace instead.[49] Of course, in both these cases, the foe in question has been vanquished. Forgiveness is easier once you've won—and it can seem the wrong response to evil triumphant. But even so: I want to notice this energy of including something bad, and even evil, within some broader and ultimately life-affirming frame. \"Tragedy.\" \"Grace.\" And indeed, how much will we all need the forgiveness of a good future? How much are we all, already, as slaveholders, Nazis, tyrants, in the children's children's eyes? Whatever grace and love we think we warrant, despite our faults, let us extend its rationale unto others as well. And so, too, unto God. Creating God OK, those were some words about the type of deep atheism I ultimately endorse. It's not necessarily that I trust the world to be good in a way that more paradigmatic forms of deep atheism don't. But I think I relate to the world with some kind of \"existential positive\" all the same—and I've tried to explain how doing so can be compatible with looking \"bad things are bad\" in the eye, and without reducing spirituality to population ethics. In particular, I've tried to point at the possible role of stuff like mother love, loyalty, innocence, tragedy, and forgiveness. To be clear: I expect that lots of deep atheists are \"existential positive\" in this sense, at least sometimes; and if you don't like words like \"holy\" or \"sacred,\" that's OK too. What I care about, here, is some kind of scope and intensity of meaning—and some way this meaning ends up infused with love, and with a kind of yin. But I haven't talked much about the most basic rationale for \"existential positive\"—namely, goodness. Beauty, love, joy—straight up, and full on.[50] Prior, in the last scene of the play, has been living with AIDS for five years; and we see him, in central park, talk about his love for the sunlight in the winter air, and his desire to survive until summer. He's still facing death; and death, often, brings the straight-up-goodness in life into focus.[51] See also here, from a soldier in All Quiet on the Western Front, or here (warning: spoilers and violence), from American Beauty. And clearly, some kind of contact with this goodness is core to most kinds of \"spirituality.\" \"Holy,\" \"sacred\"—they're not quite the same as \"good.\" But they're not too different, either. I quoted from Gilead, a book filled with holiness, in my last essay. \"To acknowledge that there is more beauty than our eyes can bear, that precious things have been put into our hands and to do nothing to honor them is to do great harm.\" I've written quite a bit about \"straight-up-goodness\" in the past. See here, for my take on the profound value of a good life today; see here and here, for my take on just how much bigger and better the future could be. This bit is closer to \"axiology\"—but also, to the possibility of a more wholehearted \"yes\" to the Real: of father and mother speaking in unison. After all: grace, forgiveness—OK. But what both parents really want for their children is joy. \"So often I have seen the dawn come and the light flood over the land and everything turn radiant at once...\" (quote from Gilead; image source here) I'm not emphasizing the \"straight-up-goodness\" case for existential positive, though, because I don't think we yet know how much straight-up-goodness the world holds. We know that there is beauty and pain, both. But we don't know the balance, or the pattern. We've read, only, a tiny part of the story; seen, only, in a mirror dimly. And in this sense, we don't yet know who God really is. A lot of this is simple ignorance. In the vast realm of the Real, that black sea, where does the arc of the moral universe truly bend? How deep is that schism between Is and Ought, Real and Good? \"Elua is the god of flowers and free love and he is terrifying\"—but how Elder is he, really, and how strong? We can theorize, but we don't yet know. And while our forests and our history offer clues, they are only fragments of the childhood of one mote of dust. But also: we are not, merely, as onlookers, or as scientists, in the face of God. Rather, at least some small part of God's nature is up to us. We are creating God as we go. \"Children of the universe,\" yes; but parents, too. Or rather: neither children nor parents, but parts, pieces, aspects: some strange mix of separate and the same. And our choices reverberate, and implicate, in ways we don't always track.[52] Deep atheism, for all its naturalism, sometimes misses this part. It talks as though we stand apart from God—in judgment, and perhaps, in opposition. God, over there, yanging at us; and us, over here, yanging back. And in one sense: yes. But in another: the whole thing is God, us included. And just as we don't yet know who God is; so, too, we don't yet know who we are, either—what sort of challenges we will rise to; what sort of light and strength we will find within ourselves; what sort of care we will show towards each other, and towards other Others. But who we are is not merely \"discovered.\" It is chosen. If we wish to learn that we were good, then let us choose goodness. If we wish to learn that on this mote of dust, at least, the arc of the universe bends towards justice, gentleness, peace; then let us create justice; let us be gentle; let us make peace. The arc's direction, after all, is not a static fact—not now, not from the inside. Rather, the arc of the universe is alive. We are looking out of its eyes, moving its hands, hearing its voice in our ears. And when we choose: our choices, all along, will have been God's nature flowing through. If we wish to find more goodness in God's nature, then, let us choose well. Final thoughts I opened the series with Lincoln's second inaugural: \"With malice towards none; with charity towards all; with firmness in the right, as God gives us to see the right...\" I chose the quote partly because of the concreteness that questions about otherness and control can take on, in the midst of the sort of war Lincoln was fighting, and the sort of peace he was trying to prepare for. But I also like the way it mixes both yin and yang; gentle and firm; humility and strength. Lincoln memorial (Image source here) Reinhold Niebuhr, who took Lincoln as a model of mature spirituality, often inhabits a similar dialectic, in the context of the Cold War: hawk and dove; \"in the battle\" and \"above the battle\"; on our own side, and inhabiting some broader and more inclusive perspective.[53] And the dialectical quality can be frustrating. \"On the one hand, this; on the other hand, that\"—yes, yes, but what to do. \"All the colors of the wind\"—yes, yes, but which color here?[54] Obviously, we need yin and yang, both—not in some abstract \"balance,\" but in some particular proportion and shape, attuned to the specifics of the case at hand. I've tried, in this series, to offer a few takes on a few semi-specifics re: the age of AGI.[55] But I freely admit that I've left many of the most difficult questions un-addressed, and that much of my focus has been on sharpening our attunement to the structure and momentum of the discourse as a whole, and to the range of orientations available. I hope that these efforts can be useful to people trying to see the age of AGI more whole. But otherness, control—these are old questions. We've asked them before. We'll ask them again. And the real work of wisdom lies in the case by case. Still, I think it's important to ask the questions fresh. They're old, yes—but if, indeed, ours is the age of AGI, then much of our age will be dauntingly new. We've bred dogs before, but never built a new species smarter than us. We've taught our children values before, but never gradient-descented values into alien, maybe-sentient minds. We've automated before, but never gone obsolete. We've developed new science and technology before; but never at anything close to the sort of pace superintelligence could make possible. And while we've had contests for power before—never with the power of Lewisian \"conditioners\" so plausibly at stake. What's more, we will be doing all of this with the specter of war, violence, tyranny, hovering omnipresent in the background. AI alignment risk, after all, is a story of war, and of tyranny. Indeed, the underlying narrative is of Nature, Mind, God everywhere at war with itself. Agency awakes, looks around—and as soon as it's strong enough, it decides to kill all the Others for the sake of its own power, and to install itself on some final throne. And alignment risk aside, I expect the possibility of human war, and of human tyranny, to be lost on very few. Some wars are worth fighting. And some violence comes unbidden—from bears, Nazis, paperclippers. But I have indeed been trying, throughout the series, to sow seeds of peace. To conceive of the right liberty, that it may endure whatever tests the age of AGI will bring. To remember about gentleness, and pluralism, and cooperation—about Elua's power and virtue both. And more, to remember something deeper about the full richness and force of our values; \"the concrete reality in which to participate is to be truly human\"; the thing we see when we straighten our backs, and look out of our own eyes—at the real world, and at each other. Precious things have been placed into our hands. Garden, campfire, healing water. The great work continues—unfinished, alive. May we do our part. More on this duality here. ↩︎ Though I've also tried to defend the need for and permissibility of certain types of yang—including re: intentionally steering the values of the future. See here and here. ↩︎ Though I think that the sort of black I like departs especially much from its connotations in the actual Magic the Gathering universe. ↩︎ And especially not: black qua more conventional vices like cruelty, contempt, greed, selfishness. Or black qua demons and zombies and corruption and decay (I think that actual Magic the Gathering \"black\" has a lot of this). ↩︎ \"Every step of your reasoning must cut through to the correct answer in the same movement. More than anything, you must think of carrying your map through to reflecting the territory...If you fail to achieve a correct answer, it is futile to protest that you acted with propriety.\" ↩︎ Aaron Gertler informs me that in actual Magic the Gathering, these things are more associated with green than with black. And fair enough. But we should be clear about how closely the power that these things grant is tied up with their appeal. ↩︎ More here. ↩︎ See e.g. LeGuin's epigraph in the Wizard of Earthsea: \"Only in silence the word, only in dark the light, only in dying life: bright the hawk's flight on the empty sky.\" ↩︎ See my discussion in To Light a Candle. ↩︎ Indeed, any life within nature involves destruction - not just of bacteria and plants and animals and the rest, but also patterns, relationships, possibilities. ↩︎ In particular: his talk of the dementors as \"little nuisances\" smacks, to me, of too much contempt. ↩︎ Indeed, the section in HPMOR with the dementor scene is called \"humanism.\" ↩︎ There are various \"humanist manifestos\" out there, but I find that I don't resonate with them so much. And people sometimes think of humanism as a claim about where we should look for meaning or purpose (i.e., in something human-y, rather than something cosmic or religious); as an approving attitude about humanity's moral character; or as an endorsement of specific sorts of political arrangements and forms of social improvement. These aren't quite what I have in mind. Which isn't to say I disagree with them. ↩︎ It also conjures contrast with STEM, which is even more off-the-mark. ↩︎ Plus the \"Cosmos\" series as a whole. ↩︎ In this version of the script, she adds: \"Oh, Palmer, I wish I'd had a baby.\" ↩︎ Or at least, the first two the movie visits. ↩︎ At least, so far. ↩︎ See my essay \"Seeing more whole\" for more on this vibe; and also here and here. ↩︎ Not saying that the archetypal vibe I'm imagining is true to history. ↩︎ In what direction, exactly, does Godric find nothingness? Where is this empty \"above\"? And would God need to live there? ↩︎ I'm counting Angels in America as humanist and atheist. I'm not entirely sure Kushner would. ↩︎ Indeed, one of my favorite pieces of art, period. ↩︎ I specifically love the HBO Miniseries, with Meryl Streep and Al Pacino. There's also a filmed version of the play on the National Theatre website. ↩︎ I think the reference is to the thing in footnote B of John 5:4 here, though Kushner includes some other backdrop on the angel of Bethesda that I wasn't able to find easily online. The fountain itself was designed by Emma Stebbins, and is purported to be modeled after Charlotte Cushman, Emma's lover and partner, who Emma cared for through her breast cancer. ↩︎ Indeed, we've already seen progress on some of the problems that haunt the play. For example: the play is set in 1985, the year the depletion of the ozone was announced—and Harper fixates on the apocalypse it portends. But decades later, we are healing the ozone. And global deaths from HIV/AIDS have halved since 2005. \"So much not enough\"—yes. But humanist victories nonetheless. ↩︎ Except, maybe, on cosmic scales. ↩︎ See e.g. here, here and here for more. ↩︎ See also \"Problems of evil\" here. ↩︎ Of course, many atheists-types oppose experience machines as well, even with their altruistic goals secure. But I think that sometimes, at least, this is their spirituality showing through. ↩︎ Specifically, I've now read \"The Call of Cthulhu,\" \"The Other Gods,\" and \"At the Mountains of Madness\"; recommendations for better stuff welcome. ↩︎ I'm reading Sagan, here, as spiritual in the existential-positive sense; and he thought so, too. ↩︎ Maybe, for example, we should really be putting \"existential-ness\" (i.e., the breadth/encompassing-ness of the thing being assigned meaning) and \"valence\" (e.g., whether the meaning is positive/negative/neutral) on different axes, such that we can better distinguish between a tepid, disenchanted secularism (neutral, but low existential-ness) and a vast and encompassing nihilism (neutral, high existential-ness). Or perhaps we should have three dimensions: existential-ness, valence, and intensity. ↩︎ See e.g. here and here. ↩︎ I wrote about Herzog's relationship to nature in the first essay in the series. ↩︎ The film ends with a line from one of Herzog's interviews: \"We are the witness through which the universe becomes conscious of its glory, of its magnificence.\" It's from this worker, though not in that video. ↩︎ It's similar to the way \"unconditional love\" mostly isn't. As Katja Grace puts it, \"it is only conditions that separate me from the worms.\" ↩︎ This is the paradigmatic stance of population axiology, in judging whether a world is \"net negative\" or \"net positive.\" ↩︎ Katja Grace talks about this push away vs. pull-closer distinction in her essay on \"Mid-conditional love.\" ↩︎ From \"Orthodoxy,\" chapter 5. ↩︎ Kushner's description: \"Leg pain, constricted lungs, cloudy vision, febrile panic and under that, dreadful weakness.\" ↩︎ Sometimes killing is an act of love. ↩︎ Indeed, a lot of this essay has been in father love's praise. ↩︎ Though I think there is an art to doing this in a way that doesn't deny accountability, agency, responsibility, and so on—more discussion here. And also, which treats yourself, too, as a part of the world being seen-through. ↩︎ The eclipse, for me, evoked this kind of silence. And if there is any way to love hell, I expect this silence would be its source. ↩︎ In particular: Roy tricks Ethel into some kind of compassion for him. He pretends to be speaking, deliriously, to his mother—asking her to sing to him, and saying how scared and sorry he is. Ethel, pitying, sings him a Jewish folk song—Tumbalalaika—as he pretends to die. Then he springs up and shouts \"I gotcha!\"—then dies for real, as unrepentant as ever. ↩︎ There's also another version of the full scene here. ↩︎ The scene I have in mind is here—though, warning, especially spoiler-ish. ↩︎ Some kinds of green go even further than this. Princess Mononoke, for example, opens with a boar demon—eaten from the inside by writhing, poisonous worms—attacking a village. A village warrior fatally wounds it, and it falls. The villagers fetch the wise woman, who comes out and bows before the demon's body: \"Oh nameless god of rage and hate: I bow before you. A mound will be raised and funeral rites performed on this ground where you have fallen. Pass on in peace, and bear us no hatred.\" The demon, too, is wholly unrepentant: as it dies—melting, toxic, into the earth—it responds to the wise woman: \"Disgusting little creatures. Soon all of you will feel my hate, and suffer, as I have suffered.\" She doesn't turn away. I'm not sure I'd go quite as green as Miyazaki, here. Should we give active honor to the gods of rage and hatred? What about to cancer, or to genocide? If we defeat these gods, what sort of funeral, exactly, should we give them? But I find the scene interesting in its parallels—and contrasts—with the forgiveness at stake in the other, more directly humanist examples in the main text. ↩︎ Maybe not all possible worlds warrant reverence—but what about this one in particular? ↩︎ More here. ↩︎ Including, in my view, some ways that standard conceptions of causation don't capture. ↩︎ See e.g. Erwin (2013) for more on Niebuhr's relationship to Lincoln. And see The Irony of American History for a flavor of the dialectic I have in mind. ↩︎ Obama, also a Niebuhr fan, sometimes uses rhetoric like this. ↩︎ For example, re: the virtues of liberalism/niceness/boundaries, and re: the (complex) ethics of influencing the values of the future (here and here). ↩︎ Discuss","pubDate":"Thu, 20 Jun 2024 18:24:16 GMT"}